**강사: 멀티캠퍼스 강선구 강사** (sun9sun9@gmail.com)

## SQL 실습 노트 사용 NOTE 사용법

- 셀 실행법 I: SHIFT + 엔터: 셀을 실행 시킨후 다음 셀로 포커스를 이동
- 셀 실행법 II: CTRL + 엔터: 셀을 실행 시키고 포커스 이동 하지 않음
- 일단 아래 셀을 실행시켜주세요

In [1]:
# 이 영역은 수정하시면 안됩니다.

import os
import pandas as pd
from sqlalchemy import create_engine, text
import cx_Oracle
from IPython.core.magic import register_cell_magic

import sys
if sys.version.find('GCC') >= 0:
    DATABASE_URL = "oracle+cx_oracle://lib:multisqld@oracle-db:1521/?service_name=XEPDB1"
else:
    cx_Oracle.init_oracle_client(lib_dir = r"C:\Oracle\instantclient_23_7")
    DATABASE_URL = "oracle+cx_oracle://lib:multisqld@localhost:1521/?service_name=XEPDB1"
engine = create_engine(DATABASE_URL)
def get_rows(qry):
    try:
        with engine.connect() as conn:
            result = conn.execute(text(qry))
            return pd.DataFrame(result.fetchall(), columns = result.keys()).fillna('NULL').pipe(lambda x: x.set_index(x.index + 1))
    except Exception as e:
        print(e)

def exec_qry(qry):
    try:
        with engine.connect() as conn:
            result = conn.execute(text(qry))
            conn.commit()
            return result
    except Exception as e:
        print(e)

@register_cell_magic
def SQL(line, cell):
    sql = cell.strip().replace(';', '')
    if sql.lower().startswith('select'):
        return get_rows(sql)
    else:
        exec_qry(sql)

## SQL 구문을 임의로 추가 하는 법

- "+" 버튼을 누르면 노트북에 셀이 샐깁니다.
- 셀 시작 위치에 %%SQL을 입력하고 그 다음 라인에 SQL 문을 적으면 됩니다.

In [2]:
%%SQL

SELECT * FROM tab WHERE tname not like 'BIN%' and tabtype = 'TABLE' -- 현재 database에 있는 table을 출력합니다.

              tname tabtype clusterid
1              BOOK   TABLE      NULL
2      BOOKCATEGORY   TABLE      NULL
3        BOOKDETAIL   TABLE      NULL
4     BOOKSTATISTIC   TABLE      NULL
5         BOOKSTOCK   TABLE      NULL
6           BOOKTAG   TABLE      NULL
7         BOOK_INFO   TABLE      NULL
8            MEMBER   TABLE      NULL
9   MEMBERSTATISTIC   TABLE      NULL
10           RATING   TABLE      NULL
11             RENT   TABLE      NULL
12           REVIEW   TABLE      NULL
13              TAG   TABLE      NULL

In [3]:
%%SQL

SELECT * FROM tab WHERE tname not like 'BIN%' and tabtype = 'VIEW' -- 현재 database에 있는 view를 출력합니다.

         tname tabtype clusterid
1        BOOK1    VIEW      NULL
2     BOOKSTAT    VIEW      NULL
3  BOOK_RATING    VIEW      NULL
4      MEMBER1    VIEW      NULL
5      MEMBER2    VIEW      NULL
6        RENT1    VIEW      NULL

# SELECT

## SELECT 기본 문법

```sql
SELECT [ALL/DISTINCT] 컬럼명1 [as 명칭1], 컬럼명2 [as 명칭2], ...
FROM 테이블명[ALIAS];
```

**컬럼명**: \[테이블명.\]컬럼명

**[예제 1]**  SELECT의 기본 기능을 확인합니다.

**[book1 테이블]**

![image.png]()

- book1에서 book_id, book_title을 조회합니다.

In [4]:
%%SQL

SELECT book1.book_id, book1.book_title FROM book1;

    book_id                       book_title
1      2219                             사피엔스
2      1097                        문학이란 무엇인가
3      1061                            양철북 2
4      3270  뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)
5      3233      뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)
6      2497                        생명이란 무엇인가
7      1137                      잃어버린 아이 이야기
8      1059                              데미안
9      3345   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1
10     1092                          동주와 빈센트

- 테이블명을 생략할 수 있습니다. 생략하면 FROM 구에 있는 테이블이 지정됩니다.

In [5]:
%%SQL

SELECT book_id, book_title FROM book1;

    book_id                       book_title
1      2219                             사피엔스
2      1097                        문학이란 무엇인가
3      1061                            양철북 2
4      3270  뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)
5      3233      뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)
6      2497                        생명이란 무엇인가
7      1137                      잃어버린 아이 이야기
8      1059                              데미안
9      3345   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1
10     1092                          동주와 빈센트

- book1에서 book_id의 명칭을 책 ID, book_title의 명칭을 책제목으로 하여 조회합니다.

In [6]:
%%SQL

SELECT book_id as "책 ID", book_title as 책제목
FROM book1;

    책 ID                              책제목
1   2219                             사피엔스
2   1097                        문학이란 무엇인가
3   1061                            양철북 2
4   3270  뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)
5   3233      뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)
6   2497                        생명이란 무엇인가
7   1137                      잃어버린 아이 이야기
8   1059                              데미안
9   3345   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1
10  1092                          동주와 빈센트

- book1 테이블의 alias(약칭)를 a로 하고 a에서 book_id와 book_title를 불러 옵니다. 

  book_id의 명칭은 책 ID, book_title은 책제목으로 합니다.

In [7]:
%%SQL

SELECT a.book_id as "책 ID", a.book_title as 책제목
FROM book1 a;

    책 ID                              책제목
1   2219                             사피엔스
2   1097                        문학이란 무엇인가
3   1061                            양철북 2
4   3270  뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)
5   3233      뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)
6   2497                        생명이란 무엇인가
7   1137                      잃어버린 아이 이야기
8   1059                              데미안
9   3345   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1
10  1092                          동주와 빈센트

- Asterisk * 는 모든 컬럼을 보여 줍니다.

- book1의 모든 컬럼을 가져 옵니다.

In [8]:
%%SQL

SELECT * FROM book1;

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- book1에서 publisher 컬럼의 내용을 고유값을(중복값을 빼고) 가져 옵니다.

In [9]:
%%SQL

SELECT DISTINCT publisher FROM book1;

  publisher
1       김영사
2       민음사
3       마더텅
4  까치(까치글방)
5       한길사
6    저녁달고양이

- book1에서 book_categ_id, publisher 의 내용을 중복 없이 가져옵니다.

In [10]:
%%SQL

SELECT DISTINCT book_categ_id, publisher FROM book1;

   book_categ_id publisher
1           1062       김영사
2            509       민음사
3            489       민음사
4           1550       마더텅
5           1535       마더텅
6           1196  까치(까치글방)
7            534       한길사
8           1568       마더텅
9            503    저녁달고양이

## SELECT 일반적인 문법

```SQL
SELECT [ALL/DISTINCT] 표현식1 [as 명칭1], 표현식2 [as 명칭2], …
FROM 테이블명 [ALIAS];
```
### 표현식

- 리터럴, 컬럼명, 함수, 연산자를 통해 출력 컬럼 값을 정의하는 식

#### SQL 리터럴

- 리터럴: 값을 표시하는 형식

|유형|형식|예제|
|----|----|----|
|숫자(Numeric)|정수 또는 실수|123, 3.14, -42, …, 1e6(1×106)|
|문자열(String)|시작과 끝을 따옴표(') 감싼다.|'Hello', 'SQL', ….|
|날짜|	ISO 8601: 'YYYY-MM-DD'| '2025-03-04', '1977-01-13'|
|타임스탬프(날짜와시간)| 'YYYY-MM-DD hh24:mi:ss'|'2025-03-04 12:34:56'|
|NULL 값|NULL|NULL|

**[예제 2]** SQL 리터럴에 대해 알아봅니다.

- SQL 리터럴을 바탕으로 숫자, 문자열, 일자 등의 값을 나타내 봅니다

In [11]:
%%SQL

SELECT
    123 as 정수, 3.14 as 실수, 1e6 as "10의 승수", 
    'Hello' as 문자열, '2025-03-16' as 날짜, '2027-07-17 17:07:07' as 일시, NULL as 널
FROM dual;

    정수    실수   10의 승수    문자열          날짜                   일시     널
1  123  3.14  1000000  Hello  2025-03-16  2027-07-17 17:07:07  NULL

In [12]:
%%SQL

SELECT * FROM dual;

  dummy
1     X

※ dual 더미 테이블 - 무의미한 내용(dummy 컬럼에 X값)을 지닌 테이블로, 임의의 값을 만들고자 할 때 사용

### 연산자

#### 산술연산

|기호|설명|기호|설명|
|---|----|----|----|
|+|더하기|/|나누기|
|-|빼기|괄호()|우선순위지정|
|*|곱하기| | |

In [13]:
%%SQL

SELECT 1 + 2, 1 + 2 * 3, (1 + 2) * 3 FROM dual;

   1+2  1+2*3  (1+2)*3
1    3      7        9

**[bookstat 테이블]**

![image.png]()

**[예제 3]** 연산자의 기능을 알아봅니다.

- bookstat 테이블에서 rating_sum에서 rating_count를 나누어 평점평균 컬럼을 만들고,

  rent_count와 rating_count를 더해서 카운트합 컬럼을 만듭니다.

In [14]:
%%SQL

SELECT * FROM bookstat

   book_id  stat_ymd  rent_count  rating_sum  rating_count           stat_date
1     2497  20231102           0          25             3 2025-04-02 06:50:15
2     2497  20210915           0          24             3 2025-04-02 06:50:15
3      863  20191013           3           9             1 2025-04-02 06:50:15
4     3345  20201115           3           9             1 2025-04-02 06:50:15
5     1115  20220416           3           8             1 2025-04-02 06:50:15
6     1061  20200613           3           9             1 2025-04-02 06:50:15
7     1059  20240601           1          16             2 2025-04-02 06:50:15
8     2110  20220626           1          17             2 2025-04-02 06:50:15
9     1097  20210227           1          14             2 2025-04-02 06:50:15

In [15]:
%%SQL

SELECT rating_sum / rating_count as 평점평균, rent_count + rating_count as 카운트합
FROM bookstat;

                                       평점평균  카운트합
1  8.33333333333333333333333333333333333333     3
2                                         8     3
3                                         9     4
4                                         9     4
5                                         8     4
6                                         9     4
7                                         8     3
8                                       8.5     3
9                                         7     3

#### 합성연산

문자열 결합: ||

In [16]:
%%SQL

SELECT '멀티캠퍼스' || ' - ' || 'SQLD 자격 대비 과정' as "문자열 결합" FROM dual;

                  문자열 결합
1  멀티캠퍼스 - SQLD 자격 대비 과정

**[예제 4]**  문자열 합산 연산을 사용해봅니다.

- book1 에서 {book_title} - {publish} 형식 컬럼을 출력하시오

  예) book_title: 사피엔스, publisher: 김영사 → 사피엔스 - 김영사

**[book1] 테이블**

![image.png]()

- || 기능을 통해 문자열을 결합해 갑니다.

In [17]:
%%SQL

SELECT book_title || ' - ' || publisher as 제목_출판사 FROM book1;

                                   제목_출판사
1                              사피엔스 - 김영사
2                         문학이란 무엇인가 - 민음사
3                             양철북 2 - 민음사
4   뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년) - 마더텅
5       뿌리깊은 초등국어 독해력 1단계 (초등1,2학년) - 마더텅
6                    생명이란 무엇인가 - 까치(까치글방)
7                       잃어버린 아이 이야기 - 한길사
8                               데미안 - 민음사
9    초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1 - 마더텅
10                       동주와 빈센트 - 저녁달고양이

# 함수

입력을 받아 출력을 생성하는 역할자

**입력**

**수학**에서 입력을 **인자(Argument)**

**컴퓨터프로그래밍**에서 **매개변수(Parameter)**

SQL에서 함수호출법

```
함수명(매개변수1, 매개변수2, ...)
```

**[예제 5]** 함수의 사용 해봅니다.

In [18]:
%%SQL

SELECT cos(0), cos(3.1415925 / 2), sin(0), sin(3.1415925 / 2)  FROM DUAL;

,COS(0),COS(3.1415925/2),SIN(0),SIN(3.1415925/2)
1,1,7.67948966192312462092172336482E-8,0,0.9999999999999970512719266207883081904592

## 문자 함수
|문자 함수|기능|
|----|----|
|LOWER(문자열)|소문자로 변환|
|UPPER(문자열)|대문자로 변환|
|ASCII(문자열)|아스키 코드로 변환|
|CHR/CHAR(ASCII코드)|아스키 코드를 문자열로 변환|
|CONCAT(문자열1, 문자열2)|문자열1과 문자열2를 결합, ORACLE \|\|, SQL Server + 와 동일|
|SUBSTR/SUBSTRING(문자열, m[, n])|문자열 중에 m 위치에서 시작하여 n개의 문자들을 가져 옴.  n이 생략되면 이후 모든 문자들을 가져 옴|
|LENGTH/LEN(문자열)|길이 반환|
|LTRIM(문자열\[, 지정문자\])/LTRIM(문자열)|문자열 좌측에서 지정 문자가 나타나면 해당 문자 제거(지정 문자가 생략되면,공백)<br/>SQL Server에서는 공백이 나타나면 제거(문자 지정 불가)|
|RTRIM(문자열, 지정문자)/RTRIM(문자열)|문자열 우측에서 지정 문자가 나타나면 해당 문자 제거 (지정 문자가 생략되면,공백)<br/>SQL Server에서는 공백이 나타나면 제거(문자 지정 불가)|
|TRIM([leading\|trailing\|both] 지정문자 FROM 문자열)<br/>TRIM(지정문자 FROM 문자열)|문자열에서 머리말(좌측, leading), 꼬리말(우측, trailing), 또는 양쪽(both)에 지정 문자가 나타나면 제거. 생략 시 both <br/>SQL server는 leading, trailing, both의 지정 기능이 없고, 양쪽으로 적용됨|

**[member1]** 테이블

![image.png]()

**[예제 6]** 문자열 함수를 사용해봅니다.

- member1 에서 member_id와 member_id를 대분자로 변환하여 출력하시오.

In [19]:
%%SQL

SELECT member_id, upper(member_id), lower(member_id) FROM member1;

          member_id  UPPER(MEMBER_ID)  LOWER(MEMBER_ID)
1      ze3herzyk1qt      ZE3HERZYK1QT      ze3herzyk1qt
2     tm965wcz7f4ob     TM965WCZ7F4OB     tm965wcz7f4ob
3     3huv3i06r0kjq     3HUV3I06R0KJQ     3huv3i06r0kjq
4  q056e4pksva2jxr4  Q056E4PKSVA2JXR4  q056e4pksva2jxr4
5      2457e3i56i37      2457E3I56I37      2457e3i56i37
6   pqdjzohyv0zx2u4   PQDJZOHYV0ZX2U4   pqdjzohyv0zx2u4
7    eqf2ulxx6fns6q    EQF2ULXX6FNS6Q    eqf2ulxx6fns6q
8     fy32r7vjr0irp     FY32R7VJR0IRP     fy32r7vjr0irp

- member1 에서 region과 address1를 중간에 공백을 두고 결합하고 컬럼 이름을 주소1로 하여 출력합니다.

In [20]:
%%SQL

SELECT CONCAT(CONCAT(region, ' ' ), address1) as 주소1, region || ' ' || address1 as 주소2 FROM member1;

            주소1           주소2
1      경상북도 영주시      경상북도 영주시
2      충청북도 음성군      충청북도 음성군
3   경기도 성남시 중원구   경기도 성남시 중원구
4     인천광역시 남동구     인천광역시 남동구
5      충청남도 논산시      충청남도 논산시
6      광주광역시 북구      광주광역시 북구
7      광주광역시 서구      광주광역시 서구
8  경상남도 창원시 진해구  경상남도 창원시 진해구

- member1 에서 member_name과, member_name에 앞에 첫글자 즉, 성을 떼어 내고, 그리고 두번째 글자 즉, 이름을 떼어 냅니다.

  그리고 member_name은 성명, 그 다음 성, 그리고 이름으로 컬럼명을 정합니다.

In [21]:
%%SQL

SELECT * FROM member1

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

In [22]:
%%SQL

SELECT member_name 성명, SUBSTR(member_name, 1, 1) 성, SUBSTR(member_name, 2) 이름 FROM member1;

    성명  성  이름
1  황수호  황  수호
2  이지후  이  지후
3   장준  장   준
4  박준우  박  준우
5  정연서  정  연서
6  김가현  김  가현
7  강예은  강  예은
8  박기현  박  기현

- 위치 인덱스에 음수를 사용하면 마지막을 기준으로 지정할 수 있습니다.

- member1 에서 address1과 address1에서 마지막 하나 이전 부터 문자를 분리합니다.

In [23]:
%%SQL

SELECT address1, SUBSTR(address1, -1) as 구역 FROM member1;

  address1 구역
1      영주시  시
2      음성군  군
3  성남시 중원구  구
4      남동구  구
5      논산시  시
6       북구  구
7       서구  구
8  창원시 진해구  구

In [24]:
pd.Series([chr(i) for i in range(65, 65 + 26)], index = [i for i in range(65, 65 + 26)]).rename('').to_frame().T

 65 66 67 68 69 70 71 72 73 74  ... 81 82 83 84 85 86 87 88 89 90
  A  B  C  D  E  F  G  H  I  J  ...  Q  R  S  T  U  V  W  X  Y  Z

[1 rows x 26 columns]

- CHR은  ASCII 코드를 문자로 치환합니다.
- ASCII는 문자를 ASCII 코드로 치환합니다.

- 문자열 코드 다루는 함수를 알아 봅니다. CHR은 ASCII 코드를 문자로, ASCII는 문자를 ASCII코드로 바꿔줍니다.

In [25]:
%%SQL

SELECT CHR(65), ASCII('A') FROM dual;

  CHR(65)  ASCII('A')
1       A          65

- member1에서  member_id의 길이를 출력하고, member_id

In [26]:
%%SQL

SELECT length(member_id), member_id FROM member1;

   LENGTH(MEMBER_ID)         member_id
1                 12      ze3herzyk1qt
2                 13     tm965wcz7f4ob
3                 13     3huv3i06r0kjq
4                 16  q056e4pksva2jxr4
5                 12      2457e3i56i37
6                 15   pqdjzohyv0zx2u4
7                 14    eqf2ulxx6fns6q
8                 13     fy32r7vjr0irp

- ltrim 좌측 공백을 제거
- rtrim 우측 공백을 제거

- member1에서 member_id 앞에는 공백 2개 뒤에는 공백 3개를 붙이고, 좌측 공백을 제거하고, 우측 공백을 제거하여 문자열의 길이를 측정합니다.

In [27]:
%%SQL

SELECT length('  ' || member_id || '   '), ltrim('  ' || member_id || '   '), length(ltrim('  ' || member_id || '   ')),
ltrim('  ' || member_id || '   '), length(rtrim('  ' || member_id || '   ')) 
FROM member1;

,LENGTH(''||MEMBER_ID||''),LTRIM(''||MEMBER_ID||''),LENGTH(LTRIM(''||MEMBER_ID||'')),LTRIM(''||MEMBER_ID||''),LENGTH(RTRIM(''||MEMBER_ID||''))
1,17,ze3herzyk1qt,15,ze3herzyk1qt,14
2,18,tm965wcz7f4ob,16,tm965wcz7f4ob,15
3,18,3huv3i06r0kjq,16,3huv3i06r0kjq,15
4,21,q056e4pksva2jxr4,19,q056e4pksva2jxr4,18
5,17,2457e3i56i37,15,2457e3i56i37,14
6,20,pqdjzohyv0zx2u4,18,pqdjzohyv0zx2u4,17
7,19,eqf2ulxx6fns6q,17,eqf2ulxx6fns6q,16
8,18,fy32r7vjr0irp,16,fy32r7vjr0irp,15

- ltrim, rtrim에 공백말고 제거할 문자 지정, ltrim(문자열, 제거 문자), rtrim(문자열, 제거 문자)

1. ltrim, rtrim 기능을 확인하기 위해, member_id 좌측에 '\_\_\_' 우측에 '\_\_' 를 붙여 놓는 SQL을 만듭니다.
2. ltrim으로 좌우에 '\_'를 문자열을 붙인 것에서 좌측의 '_'를 제거합니다.
3. rtrim으로 좌우에 '\_'를 문자열을 붙인 것에서 좌측의 '_'를 제거합니다.
4. trim(both 문자열 from 컬럼)으로 양쪽에 붙은 것을 제거합니다.

In [28]:
%%SQL

SELECT '___' || member_id || '__'  FROM member1;

  '___'||MEMBER_ID||'__'
1      ___ze3herzyk1qt__
2     ___tm965wcz7f4ob__
3     ___3huv3i06r0kjq__
4  ___q056e4pksva2jxr4__
5      ___2457e3i56i37__
6   ___pqdjzohyv0zx2u4__
7    ___eqf2ulxx6fns6q__
8     ___fy32r7vjr0irp__

In [29]:
%%SQL

SELECT ltrim('___' || member_id || '__', '_') FROM member1;

  LTRIM('___'||MEMBER_ID||'__','_')
1                    ze3herzyk1qt__
2                   tm965wcz7f4ob__
3                   3huv3i06r0kjq__
4                q056e4pksva2jxr4__
5                    2457e3i56i37__
6                 pqdjzohyv0zx2u4__
7                  eqf2ulxx6fns6q__
8                   fy32r7vjr0irp__

In [30]:
%%SQL

SELECT rtrim('___' || member_id || '__', '_') FROM member1;

  RTRIM('___'||MEMBER_ID||'__','_')
1                   ___ze3herzyk1qt
2                  ___tm965wcz7f4ob
3                  ___3huv3i06r0kjq
4               ___q056e4pksva2jxr4
5                   ___2457e3i56i37
6                ___pqdjzohyv0zx2u4
7                 ___eqf2ulxx6fns6q
8                  ___fy32r7vjr0irp

- 양쪽으로 제거할 때는 trim(both 제거할 문자 FROM 컬럼)

In [31]:
%%SQL

SELECT trim(both '_' FROM '___' || member_id || '__') FROM member1;

  TRIM(BOTH'_'FROM'___'||MEMBER_ID||'__')
1                            ze3herzyk1qt
2                           tm965wcz7f4ob
3                           3huv3i06r0kjq
4                        q056e4pksva2jxr4
5                            2457e3i56i37
6                         pqdjzohyv0zx2u4
7                          eqf2ulxx6fns6q
8                           fy32r7vjr0irp

## 숫자 함수 

|숫자 함수|기능|
|------|-----|
|ABS(숫자)|절대값|
|SIGN(숫자)|양수: 1, 음수: -1, 0: 0 으로 반환|
|MOD(숫자1, 숫자2)|숫자1을 숫자2로 나눌 때의 나머지 값|
|**CEIL/CEILING(숫자)**|숫자보다 크거나 같은 최소 정수|
|**FLOOR(숫자)**|숫자보다 작거나 같은 최대 정수|
|ROUND(숫자[,m])|소수점 m자리까지 반올림, 생략: m = 0|
|TRUNC(숫자[,m])|소수점 m자리 아래는 절삭. 생략: m = 0, SQL server는 미제공|

※ CEIL, FLOOR 는 헷갈립니다. 그런 만큼 시험에 잘 나오는 기능이니 꼭 기억해두세요.

**[예제 7]** 숫자 함수를 한 번씩 사용해 봅니다.

In [32]:
%%SQL


SELECT abs(-1), SIGN(5), SIGN(-5), SIGN(0), MOD(5, 3), CEIL(5.6), FLOOR(5.6), CEIL(5), FLOOR(5), ROUND(3.14159, 3), TRUNC(3.14159, 3) FROM dual

,ABS(-1),SIGN(5),SIGN(-5),SIGN(0),"MOD(5,3)",CEIL(5.6),FLOOR(5.6),CEIL(5),FLOOR(5),"ROUND(3.14159,3)","TRUNC(3.14159,3)"
1,1,1,-1,0,2,6,5,5,5,3.142,3.141

In [33]:
%%SQL

SELECT ceil(-2.2), floor(-2.2), trunc(-2.2), ceil(2.2), floor(2.2), trunc(2.2) FROM dual

   CEIL(-2.2)  FLOOR(-2.2)  TRUNC(-2.2)  CEIL(2.2)  FLOOR(2.2)  TRUNC(2.2)
1          -2           -3           -2          3           2           2

## 숫자 함수 II

|숫자 함수|기능|
|------|-----|
|SIN, COS, TAN, …|삼각함수의 값|
|EXP(숫자)|지수함수: e^숫자, e: 오일러수(2.82813…)|
|POWER(숫자1, 숫자2)|$숫자1^{숫자2}$|
|SQRT(숫자)|제곱근|
|LOG(숫자1, 숫자2)/LOG(숫자2, 숫자1)|$log_{숫자1}(숫자2)$|
|LN(숫자)|log(_e^)숫자, e: 오일러수(2.82813…)|

**[예제 8]** 숫자 함수 II를 한번 씩 사용해 봅니다.

In [34]:
%%SQL

SELECT SIN(0), COS(0), TAN(0), SIN(3.14 / 2), COS(3.14/ 2), TAN(3.14/2), EXP(2), 2.82813 * 2.82813, POWER(2, 4), SQRT(16), LOG(2, 8), LN(EXP(2)) FROM dual

,SIN(0),COS(0),TAN(0),SIN(3.14/2),COS(3.14/2),TAN(3.14/2),EXP(2),2.82813*2.82813,"POWER(2,4)",SQRT(16),"LOG(2,8)",LN(EXP(2))
1,0,1,0,0.9999996829318346202105299238233270001992,0.00079632671073332548540853364535418588,1255.765591500691604660543007773873409681,7.3890560989306502272304274605750078132,7.9983192969,16,4,2.99999999999999999999999999999999999999,2

## 날짜 함수

|날짜 함수|함수 설명|
|----|-----|
|SYSDATE|현재 날짜와 시각을 구함|
|EXTRACT(YEAR\|MONTH\|DAY from d)|날짜 데이터에서 연월일 데이터를 추출|

**[bookstat 테이블]**

![image.png]()

**[예제 9]** 날짜 함수를 사용해봅니다.

- sysdate와 bookstat 에서 stat_date를 불러오고 sysdate와 stat_date의 일차를 구하고, 소수 둘째 자리까지 반올림합니다.`

In [35]:
%%SQL

SELECT sysdate, stat_date, sysdate - stat_date, round(sysdate - stat_date, 2) FROM bookstat;

,sysdate,stat_date,SYSDATE-STAT_DATE,"ROUND(SYSDATE-STAT_DATE,2)"
1,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
2,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
3,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
4,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
5,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
6,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
7,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
8,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1
9,2025-08-13 09:16:29,2025-04-02 06:50:15,133.101550925925925925925925925925925926,133.1

- stat_date와 stat_date에서 연도, 월, 일 을 가져옵니다.

In [36]:
%%SQL

SELECT stat_date, extract(YEAR from stat_date) as 연, extract(MONTH from stat_date) as 월, extract(DAY from stat_date) as 일 FROM bookstat;

            stat_date     연  월  일
1 2025-04-02 06:50:15  2025  4  2
2 2025-04-02 06:50:15  2025  4  2
3 2025-04-02 06:50:15  2025  4  2
4 2025-04-02 06:50:15  2025  4  2
5 2025-04-02 06:50:15  2025  4  2
6 2025-04-02 06:50:15  2025  4  2
7 2025-04-02 06:50:15  2025  4  2
8 2025-04-02 06:50:15  2025  4  2
9 2025-04-02 06:50:15  2025  4  2

## 형변환 함수

|형변환 함수|설명|
|-----|----|
|TO_NUMBER(문자형)|문자형 데이터를 숫자형으로 변환|
|TO_CHAR(숫자\|날짜\[, 포맷\])|수치/날짜형 데이터를 문자형으로 변환|
|TO_DATE(문자형\[, 포맷\])|문자형 데이터를 날짜형으로 변환|

**[예제 10]**  형변환 함수를 사용해봅니다.

In [37]:
%%SQL

SELECT stat_ymd, substr(stat_ymd, 1, 4) as 문자형연도, substr(stat_ymd, 5, 2) as 문자형월, substr(stat_ymd, 7, 2) as 문자형일,
    substr(stat_ymd, 1, 4) || substr(stat_ymd, 5, 2) || substr(stat_ymd, 7, 2) as 재결합,
    substr(stat_ymd, 1, 4) + substr(stat_ymd, 5, 2) + substr(stat_ymd, 7, 2) as 합, --암시적 데이터 유형 변환: 문자형 -> 숫자형
    to_number(substr(stat_ymd, 1, 4)) as 숫자형연도, to_number(substr(stat_ymd, 5, 2)) as 숫자형월, to_number(substr(stat_ymd, 7, 2)) as 숫자형일,
    to_number(substr(stat_ymd, 1, 4)) || to_number(substr(stat_ymd, 5, 2)) || to_number(substr(stat_ymd, 7, 2)) as 재결합2 --암시적 데이터 유형 변환: 숫자형 -> 문자형
FROM bookstat

   stat_ymd 문자형연도 문자형월 문자형일       재결합     합  숫자형연도  숫자형월  숫자형일      재결합2
1  20231102  2023   11   02  20231102  2036   2023    11     2   2023112
2  20210915  2021   09   15  20210915  2045   2021     9    15   2021915
3  20191013  2019   10   13  20191013  2042   2019    10    13  20191013
4  20201115  2020   11   15  20201115  2046   2020    11    15  20201115
5  20220416  2022   04   16  20220416  2042   2022     4    16   2022416
6  20200613  2020   06   13  20200613  2039   2020     6    13   2020613
7  20240601  2024   06   01  20240601  2031   2024     6     1    202461
8  20220626  2022   06   26  20220626  2054   2022     6    26   2022626
9  20210227  2021   02   27  20210227  2050   2021     2    27   2021227

- 일자형식
| 형식 문자열 | 설명                         | 예시 (`2025-08-07 14:30:45`) |
|-------------|------------------------------|-----------------------------|
| `YYYY`      | 4자리 연도                   | `2025`                      |
| `YY`        | 2자리 연도                   | `25`                        |
| `MM`        | 월 (2자리 숫자)              | `08`                        |
| `MON`       | 월 (영문 약어)               | `AUG`                       |
| `MONTH`     | 월 (영문 전체, 공백 포함)    | `AUGUST   `                 |
| `DD`        | 일 (2자리 숫자)              | `07`                        |
| `DY`        | 요일 (영문 약어)             | `THU`                       |
| `DAY`       | 요일 (영문 전체, 공백 포함)  | `THURSDAY `                 |
| `HH24`      | 시간 (24시간제)              | `14`                        |
| `MI`        | 분                           | `30`                        |
| `SS`        | 초                           | `45`                        |
| `AM` / `PM` | 오전/오후 표시 (12시간제)    | `PM`                        |
| `RR`        | 세기 보정 포함 2자리 연도    | `25`                        |
| `YYYYMMDD`  | 연월일 압축 포맷             | `20250807`                  |
| `J`         | 줄리안 날짜                  | `2460536`                   |

**[예제 11]** 일자형 형식을 사용하여 형변환을 합니다.

- stat_ymd를 일자 형식으로 변환합니다.

In [38]:
%%SQL

SELECT stat_ymd, to_date(stat_ymd, 'YYYYMMDD'), to_date(stat_ymd, 'YYYYMMDD') + 1 / 24 FROM bookstat

   stat_ymd TO_DATE(STAT_YMD,'YYYYMMDD') TO_DATE(STAT_YMD,'YYYYMMDD')+1/24
1  20231102                   2023-11-02               2023-11-02 01:00:00
2  20210915                   2021-09-15               2021-09-15 01:00:00
3  20191013                   2019-10-13               2019-10-13 01:00:00
4  20201115                   2020-11-15               2020-11-15 01:00:00
5  20220416                   2022-04-16               2022-04-16 01:00:00
6  20200613                   2020-06-13               2020-06-13 01:00:00
7  20240601                   2024-06-01               2024-06-01 01:00:00
8  20220626                   2022-06-26               2022-06-26 01:00:00
9  20210227                   2021-02-27               2021-02-27 01:00:00

- stat_date를 일자 형식 '연도4자리/월2자리/일2자리'에 맞춰 문자열로 변환합니다.

In [39]:
%%SQL

SELECT stat_date, to_char(stat_date, 'yyyy/mm/dd') FROM bookstat

            stat_date TO_CHAR(STAT_DATE,'YYYY/MM/DD')
1 2025-04-02 06:50:15                      2025/04/02
2 2025-04-02 06:50:15                      2025/04/02
3 2025-04-02 06:50:15                      2025/04/02
4 2025-04-02 06:50:15                      2025/04/02
5 2025-04-02 06:50:15                      2025/04/02
6 2025-04-02 06:50:15                      2025/04/02
7 2025-04-02 06:50:15                      2025/04/02
8 2025-04-02 06:50:15                      2025/04/02
9 2025-04-02 06:50:15                      2025/04/02

|함수|함수 설명|
|---|-----|
|NVL(표현식1, 표현식2) / ISNULL(표현식1, 표현식2)}|표현식1의 결과값이 NULL이면, 표현식2의 결과값으로 출력|
|NULLIF(표현식1, 표현식2)|표현식1의 결과값과 표현식2의 결과값이 같으면 NULL 아니면, 표현식1의 결과값으로 출력|
|COALESCE(표현식1, 표현식2, …, 표현식n)|표현식1에서 표현식n까지 결과값이 최초로 NULL아닌 것을 출력|

- NVL은 표현식1의 결과 중 NULL 값을 표현식2의 값으로 채웁니다.

**[예제 12]** NULL 값처리 함수를 알아봅니다.

- return_date에는 NULL값이 있습니다. NULL 값일 때는 1900-01-01으로 채웁니다.

In [40]:
%%SQL

SELECT return_date, NVL(return_date, to_date('1900-01-01', 'yyyy-mm-dd')) FROM rent1

            return_date NVL(RETURN_DATE,TO_DATE('1900-01-01','YYYY-MM-DD'))
1                  NULL                                1900-01-01 00:00:00
2   2025-02-23 11:20:50                                2025-02-23 11:20:50
3                  NULL                                1900-01-01 00:00:00
4   2025-02-26 14:13:57                                2025-02-26 14:13:57
5                  NULL                                1900-01-01 00:00:00
6   2025-02-25 12:24:10                                2025-02-25 12:24:10
7   2025-02-25 10:47:57                                2025-02-25 10:47:57
8                  NULL                                1900-01-01 00:00:00
9   2025-02-28 16:43:43                                2025-02-28 16:43:43
10                 NULL                                1900-01-01 00:00:00

- stock_seq가 1 이면 NULL 이 되게 합니다. 그리고 앞의 연산 결과를 NVL을 사용해서 NULL인 값을 1000으로 채웁니다.

In [41]:
%%SQL

SELECT stock_seq, NULLIF(stock_seq, 1), NVL(NULLIF(stock_seq, 1), 1000) FROM rent1

    stock_seq NULLIF(STOCK_SEQ,1)  NVL(NULLIF(STOCK_SEQ,1),1000)
1           4                 4.0                              4
2           1                NULL                           1000
3           3                 3.0                              3
4           2                 2.0                              2
5           2                 2.0                              2
6           1                NULL                           1000
7           2                 2.0                              2
8           1                NULL                           1000
9           1                NULL                           1000
10          1                NULL                           1000

- return_date가 NULL인 경우를 rent_date로 이 값도 NULL이면 1900-01-01 일로 채워 출력합니다.

In [42]:
%%SQL

SELECT return_date, rent_date, 
    COALESCE(return_date, rent_date, to_date('1900-01-01', 'yyyy-mm-dd')) FROM rent1

,return_date,rent_date,"COALESCE(RETURN_DATE,RENT_DATE,TO_DATE('1900-01-01','YYYY-MM-DD'))"
1,NULL,NULL,1900-01-01 00:00:00
2,2025-02-23 11:20:50,2025-02-20 16:08:11,2025-02-23 11:20:50
3,NULL,2025-02-20 16:44:32,2025-02-20 16:44:32
4,2025-02-26 14:13:57,2025-02-20 15:56:00,2025-02-26 14:13:57
5,NULL,2025-02-20 16:40:54,2025-02-20 16:40:54
6,2025-02-25 12:24:10,2025-02-20 16:03:10,2025-02-25 12:24:10
7,2025-02-25 10:47:57,2025-02-20 16:14:16,2025-02-25 10:47:57
8,NULL,NULL,1900-01-01 00:00:00
9,2025-02-28 16:43:43,2025-02-20 16:26:49,2025-02-28 16:43:43
10,NULL,2025-02-20 16:54:55,2025-02-20 16:54:55

# Case 문

```sql
Case
    WHEN 조건식1 THEN 표현식1
    [WHEN 조건식2 THEN 표현식2
    ...
    WHEN 조건식n THEN 표현식n]
    ELSE 기본 표현식
END
```

## 비교 연산 I

|비교 연산|의미|
|---|---|
|표현식1 = 표현식2|표현식1의 결과값이 표현식2의 결과값과 같은가?|
|표현식1 <> 표현식2,<br/> 표현식1 != 표현식2|표현식1의 결과값이 표현식2의 결과값과 다른가?|
|표현식1 > 표현식2|표현식1의 결과값이 표현식2의 결과값보다 큰가?|
|표현식1 < 표현식2|표현식1의 결과값이 표현식2의 결과값보다 작은가?|
|표현식1 >= 표현식2|표현식1의 결과값이 표현식2의 결과값보다 같거나 큰가?|
|표현식1 <= 표현식2|표현식1의 결과값이 표현식2의 결과값보다 같거나 작은가?|

In [43]:
%%SQL

SELECT * FROM book_rating -- book_rating을 불러 옵니다.

   book_id rating
1     2497      4
2     2497   4.17
3     3364   4.75
4     1134      4
5     1137      4
6     2239   4.25
7     3387   4.25

**[예제 13]** 
book_rating에서 아래 내용을 가져옵니다.

| 컬럼 이름 | 설명                                                                 |
|-----------|----------------------------------------------------------------------|
| book_id   | 도서의 고유 식별자. 각 레코드를 유일하게 구분하는 기본 키 역할을 합니다.         |
| rating    | 도서에 대한 평점 값. 실수형 숫자로 표현되며, 0 이상 5 이하의 값입니다.             |
| star      | rating 값에 따라 다음 기준으로 환산된 별점 문자열입니다:                        |
|           | - rating ≥ 4.5     → ★★★★★                                             |
|           | - 4.25 ≤ rating < 4.5 → ★★★★☆                                          |
|           | - 4.0 ≤ rating < 4.25 → ★★★☆☆                                          |
|           | - rating < 4.0       → ★★☆☆☆                                           |

In [44]:
%%SQL

SELECT book_id, rating,
    CASE
        WHEN rating >= 4.5 THEN '★★★★★'
        WHEN rating >= 4.25 THEN '★★★★☆'
        WHEN rating >= 4 THEN '★★★☆☆'
        ELSE '★★☆☆☆'
    END as star
FROM book_rating

   book_id rating   star
1     2497      4  ★★★☆☆
2     2497   4.17  ★★★☆☆
3     3364   4.75  ★★★★★
4     1134      4  ★★★☆☆
5     1137      4  ★★★☆☆
6     2239   4.25  ★★★★☆
7     3387   4.25  ★★★★☆

## 비교 연산 II

|비교 연산자|의미|
|----|----|
|BETWEEN a AND b|a와 b 사이의 값인가? (a, b 포함)|
|IN (list)|list 에 있는 값인가?|
|LIKE '비교문자열'|비교문자열에 해당하는가?<br/>※ 비교문자열: %, _ 기호를 통한 ‘\~시작하는’, ‘\~로 끝나는’ 등의 의미를 표현|
|IS NULL|NULL 값인가? <br/>NULL 값과 일반 비교 연산은 항상 FALSE|

**[예제 14]** 비교 연산을 활용해 봅니다.

In [45]:
%%SQL

SELECT * FROM member2 -- member2의 내용을 봅니다.

          member_id region address1  birth_year
1      ze3herzyk1qt   경상북도      영주시        1979
2     tm965wcz7f4ob   충청북도      음성군        1996
3     3huv3i06r0kjq    경기도  성남시 중원구        1989
4  q056e4pksva2jxr4  인천광역시      남동구        1962
5      2457e3i56i37   충청남도      논산시        1989
6   pqdjzohyv0zx2u4  광주광역시       북구        1958
7    eqf2ulxx6fns6q  광주광역시       서구        2000

- member2에서 아래 내용을 가져옵니다.

| 컬럼명     | 설명                                                                 |
|---------------|----------------------------------------------------------------------|
| birth_year    | 회원의 출생 연도. 숫자 형식이며, 나이 계산을 위해 현재 연도와의 차이로 사용됩니다. |
| student_type  | 출생 연도 기준 나이(age)를 활용해 구분한 학생 유형. 구분 기준은 아래와 같습니다: |
|               | - 나이 < 8           → '유치원생'                                     |
|               | - 8 ≤ 나이 ≤ 13      → '초등학생'                                     |
|               | - 14 ≤ 나이 ≤ 16     → '중학생'                                       |
|               | - 17 ≤ 나이 ≤ 19     → '고등학생'                                     |
|               | - 나이 > 19          → '대학생'                                       |

In [46]:
%%SQL

SELECT birth_year as 출생연도, extract(YEAR from sysdate) - birth_year as 나이, 
    case 
        when extract(YEAR from sysdate) - birth_year < 8 THEN '유치원생'
        when extract(YEAR from sysdate) - birth_year BETWEEN 8 AND 13 THEN '초등학생'
        when extract(YEAR from sysdate) - birth_year BETWEEN 14 AND 16 THEN '중학생'
        when extract(YEAR from sysdate) - birth_year BETWEEN 17 AND 19 THEN '고등학생'
        else '대학생'
    end as 학생구분
FROM member2

   출생연도  나이 학생구분
1  1979  46  대학생
2  1996  29  대학생
3  1989  36  대학생
4  1962  63  대학생
5  1989  36  대학생
6  1958  67  대학생
7  2000  25  대학생

-  member2에서 아래 내용을 가져옵니다.

| 컬럼명 | 설명                                                                 |
|-----------|----------------------------------------------------------------------|
| address1  | 회원의 기본 주소 정보. 시/군/구 등의 지명 정보가 포함됩니다.             |
| region2   | address1의 마지막 글자를 기준으로 구분한 지역 유형. 구분 기준은 아래와 같습니다: |
|           | - address1이 '시'로 끝나면     → '시'                                    |
|           | - address1이 '군'으로 끝나면   → '군'                                    |
|           | - 위의 조건에 해당하지 않으면 → '기타'                                  |

In [47]:
%%SQL

SELECT address1, 
    case 
        when address1 LIKE '%시' then '시'
        when address1 LIKE '%군' then '군'
        else '기타'
    end as region2
FROM member2

  address1 region2
1      영주시       시
2      음성군       군
3  성남시 중원구      기타
4      남동구      기타
5      논산시       시
6       북구      기타
7       서구      기타

- member2에서 아래 내용을 가져옵니다.

| 컬럼명| 설명                                                                 |
|-----------|----------------------------------------------------------------------|
| region    | 회원의 지역 정보를 문자열의 시작 패턴에 따라 분류한 지역 구분 컬럼입니다. 구분 기준은 다음과 같습니다: |
|           | - region 값이 '경상'으로 시작하면 → '경상도'                           |
|           | - region 값이 '전라'로 시작하면   → '전라도'                           |
|           | - region 값이 '충청'으로 시작하면 → '충청도'                           |
|           | - 위 조건에 해당하지 않으면      → 기존 region 값을 그대로 출력 또는 별도 처리 |

In [48]:
%%SQL

SELECT region, 
    case 
        when region LIKE '경상%' then '경상도'
        when region LIKE '전라%' then '전라도'
        when region LIKE '충청%' then '충청도'
        else region
    end as region2
FROM member2

  region region2
1   경상북도     경상도
2   충청북도     충청도
3    경기도     경기도
4  인천광역시   인천광역시
5   충청남도     충청도
6  광주광역시   광주광역시
7  광주광역시   광주광역시

In [49]:
%%SQL

SELECT * FROM member2 WHERE address1 LIKE '__'

         member_id region address1  birth_year
1  pqdjzohyv0zx2u4  광주광역시       북구        1958
2   eqf2ulxx6fns6q  광주광역시       서구        2000

- book1에서 아래 내용을 가져옵니다.

| 컬럼 이름 | 설명                                                                 |
|-----------|------------------------------------------------------------------------------|
| 요일      | pub_date 컬럼을 요일(Day) 형식으로 문자 변환한 값. 예: 'Monday', 'Tuesday' 등  |
| 일자구분  | 요일이 'Sunday' 또는 'Saturday'이면 '휴일', 그렇지 않으면 '평일'로 구분한 값     |

In [50]:
%%SQL

SELECT to_char(pub_date, 'Day') as 요일,
    case 
        when trim(to_char(pub_date, 'Day')) in ('Sunday', 'Saturday') then '휴일'
        else '평일'
    end 일자구분
FROM book1

           요일 일자구분
1   Sunday      휴일
2   Tuesday     평일
3   Wednesday   평일
4   Sunday      휴일
5   Thursday    평일
6   Friday      평일
7   Friday      평일
8   Friday      평일
9   Monday      평일
10  Sunday      휴일

- NULL은 '비어 있음'을 의미합니다. 비교문에서 '=', '<>', '>=', '<=' 비교연산 결과 모두 Unknown 입니다.

- rent에서 아래 내용을 가져 옵니다.

| 컬럼명 | 설명                                                                 |
|-----------|------------------------------------------------------------------------------|
| rent_date | 대여 일자. rent1 테이블의 원본 날짜 값입니다.                               |
| NULL1     | `rent_date = NULL` 조건으로 처리한 연도 추출. 항상 else절만 실행되어 연도만 출력됩니다. *(잘못된 NULL 비교 방식)* |
| NULL2     | `rent_date`가 NULL이면 -1, NULL이 아니면 해당 날짜의 연도(`extract(YEAR from rent_date)`)를 출력합니다. |

In [51]:
%%SQL

SELECT rent_date, 
    case 
        when rent_date = NULL then -1
        else extract(YEAR from rent_date)
    end as NULL1,
    case
        when rent_date is NULL then -1
        else extract(YEAR from rent_date)
    end as NULL2
FROM rent1

              rent_date   null1  null2
1                  NULL    NULL     -1
2   2025-02-20 16:08:11  2025.0   2025
3   2025-02-20 16:44:32  2025.0   2025
4   2025-02-20 15:56:00  2025.0   2025
5   2025-02-20 16:40:54  2025.0   2025
6   2025-02-20 16:03:10  2025.0   2025
7   2025-02-20 16:14:16  2025.0   2025
8                  NULL    NULL     -1
9   2025-02-20 16:26:49  2025.0   2025
10  2025-02-20 16:54:55  2025.0   2025

## 논리 연산자

|논리 연산자|의미|
|----|----|
|조건식1 AND 조건식2|조건식1과 조건식2를 만족하는가?|
|조건식1 OR 조건식2|조건식1또는 조건식2를 만족하는가?
|NOT 조건식|조건식을 만족하지 않는가?|

**[예제 15]** book1에서 아래 내용을 가져 옵니다.

| 컬럼명   | 설명 |
|----------|------|
| pub_date | `book1` 테이블의 도서 발행일을 나타내는 컬럼입니다. 원본 날짜 데이터를 그대로 출력합니다. |
| 월       | `extract(MONTH from pub_date)` 함수를 사용하여 발행일에서 월(Month) 숫자(1~12)를 추출합니다. 이후 계절 분류의 기준 값으로 사용됩니다. |
| 계절     | `pub_date`에서 추출한 월 값을 기준으로 다음 조건을 이용해 계절을 분류합니다:<br> - `월 ≥ 12 or 월 ≤ 2` → `'겨울'`<br> - `월 ≥ 3 and 월 ≤ 5` → `'봄'`<br> - `월 ≥ 6 and 월 ≤ 8` → `'여름'`<br> - 그 외 (`9~11월`) → `'가을'`<br> `CASE WHEN` 구문에서 `OR`, `AND`, `>=`, `<=`을 이용한 조건 분기 방식 예시입니다. |
| 계절2    | 동일한 계절 분류 작업을 `BETWEEN`, `NOT BETWEEN`을 활용하여 처리한 컬럼입니다. 조건은 다음과 같습니다:<br> - `월 NOT BETWEEN 3 AND 11` → `'겨울'`<br> - `월 BETWEEN 3 AND 5` → `'봄'`<br> - `월 BETWEEN 6 AND 8` → `'여름'`<br> - 그 외 (`9~11월`) → `'가을'`<br> 같은 결과를 다른 SQL 문법으로 구현한 예시로, 조건 표현 방식 비교 학습에 유용합니다. |

In [52]:
%%SQL

SELECT pub_date, extract(MONTH from pub_date) as 월,
    CASE 
        WHEN extract(MONTH from pub_date) >= 12 or extract(MONTH from pub_date) <= 2 THEN '겨울'
        WHEN extract(MONTH from pub_date) >= 3 AND extract(MONTH from pub_date) <= 5 THEN '봄'
        WHEN extract(MONTH from pub_date) >= 6 AND  extract(MONTH from pub_date) <= 8 THEN '여름'
        ELSE '가을'
    END as 계절,
    CASE 
        WHEN NOT extract(MONTH from pub_date) BETWEEN 3 AND 11 THEN '겨울'
        WHEN extract(MONTH from pub_date) BETWEEN 3 AND 5 THEN '봄'
        WHEN extract(MONTH from pub_date) BETWEEN 6 AND 8 THEN '여름'
        ELSE '가을'
    END as 계절2
FROM book1

     pub_date   월  계절 계절2
1  2015-11-01  11  가을  가을
2  1998-09-01   9  가을  가을
3  2000-03-01   3   봄   봄
4  2019-12-01  12  겨울  겨울
5  2018-03-01   3   봄   봄
6  2021-01-01   1  겨울  겨울
7  2017-12-01  12  겨울  겨울
8  2000-12-01  12  겨울  겨울
9  2019-04-01   4   봄   봄
10 2019-09-01   9  가을  가을

## 단순 Case 문


```sql
Case 표현식
    WHEN 조건값1 THEN 표현식1
    [WHEN 조건값2 THEN 표현식2
    ...
    WHEN 조건값n THEN 표현식n]
    ELSE 기본 표현식
END
```

**[예제 16]** book1에서 아래 내용을 가져 옵니다.

| 컬럼명   | 설명 |
|----------|------|
| pub_date | `book1` 테이블의 도서 발행일을 나타내는 컬럼입니다. 원본 날짜(Date) 데이터를 그대로 출력합니다. |
| weekday  | `to_char(pub_date, 'DAY')` 함수를 사용하여 발행일을 요일 문자열로 변환한 값입니다. 결과는 영어 대문자로 반환되며, 요일 문자열 끝에는 공백이 포함될 수 있어 `trim()` 처리가 필요합니다. |
| 요일     | `trim(to_char(pub_date, 'DAY'))` 결과 값을 기준으로 `CASE` 문을 이용해 해당 요일을 **한글 요일명**으로 매핑한 컬럼입니다. 조건은 다음과 같습니다:<br> - `'SUNDAY'` → `'일요일'`<br> - `'MONDAY'` → `'월요일'`<br> - `'TUESDAY'` → `'화요일'`<br> - `'WEDNESDAY'` → `'수요일'`<br> - `'THURSDAY'` → `'목요일'`<br> - `'FRIDAY'` → `'금요일'`<br> - 그 외 (예: `'SATURDAY'`) → `'토요일'`<br> 영문 요일을 한글로 변환하는 텍스트 매핑 처리 Task 예시입니다. |

In [53]:
%%SQL

SELECT pub_date, to_char(pub_date, 'DAY') as weekday,
case trim(to_char(pub_date, 'DAY'))
    when 'SUNDAY' then '일요일'
    when 'MONDAY' then '월요일'
    when 'TUESDAY' then '화요일'
    when 'WEDNESDAY' then '수요일'
    when 'THURSDAY' then '목요일'
    when 'FRIDAY' then '금요일'
    else '토요일'
    end as 요일
FROM book1

     pub_date    weekday   요일
1  2015-11-01  SUNDAY     일요일
2  1998-09-01  TUESDAY    화요일
3  2000-03-01  WEDNESDAY  수요일
4  2019-12-01  SUNDAY     일요일
5  2018-03-01  THURSDAY   목요일
6  2021-01-01  FRIDAY     금요일
7  2017-12-01  FRIDAY     금요일
8  2000-12-01  FRIDAY     금요일
9  2019-04-01  MONDAY     월요일
10 2019-09-01  SUNDAY     일요일

# WHERE 절

```SQL
SELECT [ALL/DISTINCT] 표현식1 [as 명칭1], 표현식2 [as 명칭2], …
FROM 테이블명 [ALIAS]
[WHERE 조건식];
```

**[예제 17]** WHERE 조건문을 활용해봅니다.

- member1에서 member_name 이 '준'으로 끝나는 행을 가져옵니다.

In [54]:
%%SQL

SELECT * FROM member1 
WHERE member_name like '%준'

       member_id member_name region address1 address2
1  3huv3i06r0kjq          장준    경기도  성남시 중원구  은행로 4번길

- member1에서 member_name 이 '박'으로 시작하는 행을 가져옵니다.

In [55]:
%%SQL

SELECT * FROM member1 
WHERE member_name like '박%'

          member_id member_name region address1  address2
1  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
2     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

- member1에서 member_name 에 '기'가 들어가는 행을 가져오세요.

In [56]:
%%SQL

SELECT * FROM member1 
WHERE member_name like '%기%'

       member_id member_name region address1  address2
1  fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

- member1  에서 LIKE  member_name '__' 통한 두 글자 이름을 가져와 봅니다.

In [57]:
%%SQL

SELECT * FROM member1 WHERE member_name like '__'

       member_id member_name region address1 address2
1  3huv3i06r0kjq          장준    경기도  성남시 중원구  은행로 4번길

- book1에서 pub_date의 월이 4에서 6사이인 행을 가져 옵니다.

In [58]:
%%SQL

SELECT pub_date, extract(MONTH FROM pub_date), 
    to_number(to_char(pub_date, 'mm')) as mon -- projection  last 
FROM book1 -- 1
WHERE mon BETWEEN 4 and 6 -- selection 2

(cx_Oracle.DatabaseError) ORA-00904: "MON": invalid identifier
[SQL: SELECT pub_date, extract(MONTH FROM pub_date),
    to_number(to_char(pub_date, 'mm')) as mon -- projection  last
FROM book1 -- 1
WHERE mon BETWEEN 4 and 6 -- selection 2]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [59]:
%%SQL

SELECT * FROM book1 
WHERE extract(MONTH from pub_date) between 4 AND 6

   book_id                      book_title  book_categ_id publisher   pub_date
1     3345  초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1           1568       마더텅 2019-04-01

- book1에서 publisher가 '마더텅'이고 pubdate가 2019-01-01 일 이상인 행을 가져옵니다.

In [60]:
%%SQL

SELECT * FROM book1 
WHERE publisher = '마더텅' AND pub_date >= to_date('2019-01-01', 'yyyy-mm-dd')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

In [61]:
%%SQL

SELECT * FROM book1 
WHERE publisher = '마더텅' AND to_char(pub_date, 'yyyy-mm-dd') >= '2019-01-01'

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

- rent1에서 'rent_date = NULL'인 조건으로 행을 가져옵니다.

In [62]:
%%SQL

SELECT * FROM rent1 WHERE rent_date = NULL

Empty DataFrame
Columns: [book_id, stock_seq, member_id, rent_no, rent_date, return_date]
Index: []

- rent1에서 rent__date가 NULL인 행을 가져 옵니다.

In [63]:
%%SQL

SELECT * FROM rent1 WHERE rent_date is NULL

   book_id  stock_seq      member_id  rent_no rent_date return_date
1     3227          4  1gd09up7yy04g        1      NULL        NULL
2      156          1        j5ep1e6        1      NULL        NULL

- rent1에서 'rent_date <> NULL'인 조건으로 행을 가져옵니다.

In [64]:
%%SQL

SELECT * FROM rent1 WHERE rent_date <> NULL

Empty DataFrame
Columns: [book_id, stock_seq, member_id, rent_no, rent_date, return_date]
Index: []

- rent1에서 rent_date  NULL이 아닌 행을 가져옵니다.

In [65]:
%%SQL

SELECT * FROM rent1 WHERE rent_date is not NULL

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
2,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
3,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
4,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
5,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
6,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
7,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
8,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL

# GROUP BY

```SQL
SELECT [DISTINCT] 표현식1 [as 명칭1][, 표현식2 [as 명칭2], …]
FROM 테이블명 [ALIAS]
[WHERE 조건식]
[GROUP BY 표현식1[, 표현식2, …]]
```

- GROUP BY 표현식에 표현식에 해당하는 그룹핑 값만 선택하며 그룹 정보만 선택이 됩니다. 즉 그룹의 고유값들만 출력합니다.

**[예제 18]**  그룹핑만을 합니다.

1. book1에서 publisher로 그룹핑을 합니다.

In [66]:
%%SQL 

SELECT publisher FROM book1

   publisher
1        김영사
2        민음사
3        민음사
4        마더텅
5        마더텅
6   까치(까치글방)
7        한길사
8        민음사
9        마더텅
10    저녁달고양이

In [67]:
%%SQL 

SELECT publisher FROM book1
GROUP BY publisher

  publisher
1       김영사
2       민음사
3       마더텅
4  까치(까치글방)
5       한길사
6    저녁달고양이

2. 함수를 사용할 수도 있습니다. book1에서 pub_date에서 연도를 그룹핑합니다.

In [68]:
%%SQL 

SELECT extract(YEAR from pub_date) as year
FROM book1
GROUP BY extract(YEAR from pub_date)

   year
1  2015
2  1998
3  2000
4  2019
5  2018
6  2021
7  2017

In [69]:
%%SQL

SELECT extract(YEAR from pub_date) as year -- last
FROM book1 -- 1
WHERE extract(YEAR from pub_date) <= 2000 -- 2
GROUP BY extract(YEAR from pub_date) -- 3

   year
1  1998
2  2000

- WHERE 조건문은 FROM과 GROUP BY 사이에 옵니다

3. book1에서 pub_date에서 연도를 그룹핑합니다. 그리고, 연도가 2000년 이전의 행만을 뽑습니다.

In [70]:
%%SQL

SELECT extract(YEAR from pub_date) as year
FROM book1
WHERE extract(YEAR from pub_date) <= 2000
GROUP BY extract(YEAR from pub_date)

   year
1  1998
2  2000

## 집계함수

여러 행의 결과를 집계하여 하나의 결과 값으로 만들어 주는 함수

|집계함수|의미|
|------|------|
|COUNT(*)|NULL 값을 포함한 행의 수|
|COUNT([DISTINCT\|ALL] 표현식)|NULL을 제외한 행의 수|
|SUM([DISTINCT\|ALL] 표현식)|NULL을 제외한 합계|
|AVG([DISTINCT\|ALL] 표현식)|NULL을 제외한 평균|
|MAX([DISTINCT\|ALL] 표현식)|최대값|
|MIN([DISTINCT\|ALL] 표현식)|최소값|
|STDDEV([DISTINCT\|ALL] 표현식)|NULL을 제외한 표준 편차|
|VARIANCE/VAR([DISTINCT\|ALL] 표현식)|NULL을 제외한 분산|

In [71]:
%%SQL

SELECT * FROM rent1 -- rent1의 내용을 봅니다.

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,3227,4,1gd09up7yy04g,1,NULL,NULL
2,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
3,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
4,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
5,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
6,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
7,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
8,156,1,j5ep1e6,1,NULL,NULL
9,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
10,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL

**[예제 19]**  count 집계 함수를 사용해봅니다.

- count(*)는 결측을 포함한 카운팅, count(표현식)은 표현식의 결과값에 NULL을 제외하고 카운팅을 합니다.

In [72]:
%%SQL

SELECT count(*), count(rent_date), count(return_date) FROM rent1;

   COUNT(*)  COUNT(RENT_DATE)  COUNT(RETURN_DATE)
1        10                 8                   5

- count(DISTINCT 표현식)으로는 고유한 값의 카운팅을 할 수 있습니다.

reutrn_date에서 결측을 제외한 값을 가져왔습니다.
그리고 연월일(YYYYMMDD) 형식의 문자열로 변환합니다.

In [73]:
%%SQL

SELECT to_char(return_date, 'YYYYMMDD') FROM rent1 WHERE return_date is not NULL

  TO_CHAR(RETURN_DATE,'YYYYMMDD')
1                        20250223
2                        20250226
3                        20250225
4                        20250225
5                        20250228

위 표현식에 DISTINCT를 앞에 붙인것의 차이를 살펴보겠습니다.

In [74]:
%%SQL

SELECT 
    count(DISTINCT to_char(return_date, 'yyyymmdd')), 
    count(to_char(return_date, 'yyyymmdd'))
FROM rent1 WHERE return_date is not NULL

,"COUNT(DISTINCTTO_CHAR(RETURN_DATE,'YYYYMMDD'))","COUNT(TO_CHAR(RETURN_DATE,'YYYYMMDD'))"
1,4,5

In [75]:
%%SQL

SELECT * FROM bookstat -- bookstat의 내용을 가져옵니다.

   book_id  stat_ymd  rent_count  rating_sum  rating_count           stat_date
1     2497  20231102           0          25             3 2025-04-02 06:50:15
2     2497  20210915           0          24             3 2025-04-02 06:50:15
3      863  20191013           3           9             1 2025-04-02 06:50:15
4     3345  20201115           3           9             1 2025-04-02 06:50:15
5     1115  20220416           3           8             1 2025-04-02 06:50:15
6     1061  20200613           3           9             1 2025-04-02 06:50:15
7     1059  20240601           1          16             2 2025-04-02 06:50:15
8     2110  20220626           1          17             2 2025-04-02 06:50:15
9     1097  20210227           1          14             2 2025-04-02 06:50:15

- rating_count가 3을 초과한 bookstat을 가져옵니다.

In [76]:
%%SQL

SELECT * FROM bookstat WHERE rating_count > 3

Empty DataFrame
Columns: [book_id, stat_ymd, rent_count, rating_sum, rating_count, stat_date]
Index: []

- rating_count가 3을 초과한 경우는 없는데요, 비어 있는 테이블의 카운트를 봅니다.

In [77]:
%%SQL

SELECT COUNT(*) FROM bookstat WHERE rating_count > 3

   COUNT(*)
1         0

※ **주의** 이런 헷갈림이 있는 경우가 시험에 잘 나옵니다.

count가 아닌 다른 집계함수는 비어있는 테이블에 대한 집계 결과는 비어있는 테이블을 주는 건 아니고,

NULL값을 줍니다.

In [78]:
%%SQL

SELECT MAX(rating_sum), MIN(rating_sum), AVG(rating_sum) FROM bookstat WHERE rating_count > 3

  MAX(RATING_SUM) MIN(RATING_SUM) AVG(RATING_SUM)
1            NULL            NULL            NULL

**SELECT의 표현식에서 집계 함수는 GROUP BY에 의한 그룹별로 집계 연산을 수행합니다.**

**[예제 20]** GROUP BY 구문과 집계 함수로 구성한 간단한 SQL을 살펴 봅니다,

In [79]:
%%SQL

SELECT * FROM book1 -- book1의 내용을 봅니다.

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- book1에서 publisher 별 행의 수를 출력합니다.

In [80]:
%%SQL 

SELECT publisher, count(*) FROM book1
GROUP BY publisher;

  publisher  COUNT(*)
1       김영사         1
2       민음사         3
3       마더텅         3
4  까치(까치글방)         1
5       한길사         1
6    저녁달고양이         1

- book1에서 pub_date에서 연도를 추출하여, 연도별 행의 수를 출력합니다.

In [81]:
%%SQL 

SELECT extract(YEAR from pub_date) as year, count(*)
FROM book1
GROUP BY extract(YEAR from pub_date);

   year  COUNT(*)
1  2015         1
2  1998         1
3  2000         2
4  2019         3
5  2018         1
6  2021         1
7  2017         1

- book1에서 pub_date에서 연도를 추출하고, 연도 별 publisher가 NULL이 아닌 수를 출력합니다.

In [82]:
%%SQL 

SELECT extract(YEAR from pub_date) as year, count(publisher)
FROM book1
GROUP BY extract(YEAR from pub_date);

   year  COUNT(PUBLISHER)
1  2015                 1
2  1998                 1
3  2000                 2
4  2019                 3
5  2018                 1
6  2021                 1
7  2017                 1

- book1에서 pub_date에서 연도를 추출하고, 연도 별 고유한 publisher의 수를 출력합니다.

In [83]:
%%SQL 

SELECT extract(YEAR from pub_date) as year, count(DISTINCT publisher)
FROM book1
GROUP BY extract(YEAR from pub_date);

   year  COUNT(DISTINCTPUBLISHER)
1  2015                         1
2  1998                         1
3  2000                         1
4  2019                         2
5  2018                         1
6  2021                         1
7  2017                         1

- book1에서 pub_date에서 연도를 추출하고, 연도와 publisher 별 행의 수를 출력합니다.

In [84]:
%%SQL

SELECT extract(YEAR from pub_date) as year, publisher, count(*)
FROM book1
GROUP BY extract(YEAR from pub_date), publisher;

   year publisher  COUNT(*)
1  2015       김영사         1
2  1998       민음사         1
3  2000       민음사         2
4  2019       마더텅         2
5  2018       마더텅         1
6  2021  까치(까치글방)         1
7  2017       한길사         1
8  2019    저녁달고양이         1

- NULL값에 집계 결과를 확인합니다.

In [85]:
%%SQL

SELECT * FROM rent1

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,3227,4,1gd09up7yy04g,1,NULL,NULL
2,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
3,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
4,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
5,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
6,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
7,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
8,156,1,j5ep1e6,1,NULL,NULL
9,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
10,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL

In [86]:
%%SQL

SELECT to_char(return_date, 'yyyy/mm/dd'), count(*)
FROM rent1
GROUP BY to_char(return_date, 'yyyy/mm/dd')

  TO_CHAR(RETURN_DATE,'YYYY/MM/DD')  COUNT(*)
1                              NULL         5
2                        2025/02/28         1
3                        2025/02/25         2
4                        2025/02/23         1
5                        2025/02/26         1

**SELECT의 표현식들이 출력하는 행의 수는 동일해야 합니다.**

**[예제 21]** SELECT 표현식의 출력수의 불일치에 의한 오류의 예

In [87]:
%%SQL

SELECT substr(stat_ymd, 1, 4), rating_sum
FROM bookstat
GROUP BY substr(stat_ymd, 1, 4);

(cx_Oracle.DatabaseError) ORA-00979: not a GROUP BY expression
[SQL: SELECT substr(stat_ymd, 1, 4), rating_sum
FROM bookstat
GROUP BY substr(stat_ymd, 1, 4)]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

|표현식|행의 수|
|----|----|
|substr(stat_ymd, 1, 4)|GROUP BY에 표현식에 포함되어 그룹당 1개|
|rating_sum| N개|

N: bookstat 테이블의 행의 수

In [88]:
%%SQL

SELECT substr(stat_ymd, 1, 4), sum(rating_sum)
FROM bookstat;

(cx_Oracle.DatabaseError) ORA-00937: not a single-group group function
[SQL: SELECT substr(stat_ymd, 1, 4), sum(rating_sum)
FROM bookstat]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

|표현식|행의 수|
|----|----|
|substr(stat_ymd, 1, 4)|N 개|
|sum(rating_sum)| 1개(그룹 1개)|

N: bookstat 테이블의 행의 수

**[예제 22]** GROUP BY와 복수의 집계 함수를 사용합니다.

In [89]:
%%SQL

SELECT * FROM bookstat -- bookstat의 내용을 봅니다.

   book_id  stat_ymd  rent_count  rating_sum  rating_count           stat_date
1     2497  20231102           0          25             3 2025-04-02 06:50:15
2     2497  20210915           0          24             3 2025-04-02 06:50:15
3      863  20191013           3           9             1 2025-04-02 06:50:15
4     3345  20201115           3           9             1 2025-04-02 06:50:15
5     1115  20220416           3           8             1 2025-04-02 06:50:15
6     1061  20200613           3           9             1 2025-04-02 06:50:15
7     1059  20240601           1          16             2 2025-04-02 06:50:15
8     2110  20220626           1          17             2 2025-04-02 06:50:15
9     1097  20210227           1          14             2 2025-04-02 06:50:15

- bookstat에서 stat_ymd에서 1에서 4째자리까지의 문자를 취하고, 이를 기준으로 그룹별 합계와 최대값과 최소값을 구합니다.

In [90]:
%%SQL

SELECT substr(stat_ymd, 1, 4), sum(rating_sum), max(rating_sum), min(rating_sum)
FROM bookstat
GROUP BY substr(stat_ymd, 1, 4);

  SUBSTR(STAT_YMD,1,4)  SUM(RATING_SUM)  MAX(RATING_SUM)  MIN(RATING_SUM)
1                 2023               25               25               25
2                 2021               38               24               14
3                 2019                9                9                9
4                 2020               18                9                9
5                 2022               25               17                8
6                 2024               16               16               16

- 비어 있는 테이블의 GROUP BY 집계 결과는

In [91]:
%%SQL

SELECT * FROM bookstat WHERE rating_count > 3

Empty DataFrame
Columns: [book_id, stat_ymd, rent_count, rating_sum, rating_count, stat_date]
Index: []

In [92]:
%%SQL

SELECT substr(stat_ymd, 1, 4), sum(rating_count) FROM bookstat
WHERE rating_count > 3
GROUP BY substr(stat_ymd, 1, 4);

Empty DataFrame
Columns: [SUBSTR(STAT_YMD,1,4), SUM(RATING_COUNT)]
Index: []

**※ 비어 있는 테이블의 GROUP BY 집계 결과는 비어 있는 테이블입니다.**

- 복수의 그룹핑 기준에서도 각 열의 출력의 수는 일치해야 합니다.

In [93]:
%%SQL

SELECT extract(YEAR from pub_date) as year, publisher, pub_date
FROM book1
GROUP BY extract(YEAR from pub_date), publisher;

(cx_Oracle.DatabaseError) ORA-00979: not a GROUP BY expression
[SQL: SELECT extract(YEAR from pub_date) as year, publisher, pub_date
FROM book1
GROUP BY extract(YEAR from pub_date), publisher]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

|표현식|행의 수|
|----|----|
|extract(YEAR from pub_date) as year|GROUP BY에 표현식에 포함되어 그룹당 1개|
|publisher|GROUP BY에 표현식에 포함되어 그룹당 1개|
|pub_date|N개|

N: bookstat 테이블의 행의 수

**[예제 23]** 복수의 그룹핑 기준을 사용해 봅니다.

In [94]:
%%SQL

SELECT * FROM book1

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- pub_date에서 연도와 publisher로 그룹핑하여 pub_date의 최대값을 출력합니다.

In [95]:
%%SQL

SELECT extract(YEAR from pub_date) as year, publisher, max(pub_date)
FROM book1
GROUP BY extract(YEAR from pub_date), publisher;

   year publisher MAX(PUB_DATE)
1  2015       김영사    2015-11-01
2  1998       민음사    1998-09-01
3  2000       민음사    2000-12-01
4  2019       마더텅    2019-12-01
5  2018       마더텅    2018-03-01
6  2021  까치(까치글방)    2021-01-01
7  2017       한길사    2017-12-01
8  2019    저녁달고양이    2019-09-01

|표현식|행의 수|
|----|----|
|extract(YEAR from pub_date) as year|GROUP BY에 표현식에 포함되어 그룹당 1개|
|publisher|GROUP BY에 표현식에 포함되어 그룹당 1개|
|max(pub_date)|GROUP BY에 표현식에 포함되어 그룹당 1개|

N: bookstat 테이블의 행의 수

## HAVING

GROUP BY에 대한 집계 연산의 결과들로 조건을 만들어 행들을 선택

**[예제 24]** HAVING을 사용하여 GROUP BY 연산 결과를 이용한 선택을 합니다.

In [96]:
%%SQL

SELECT publisher, count(*)
FROM book1
GROUP BY publisher;

  publisher  COUNT(*)
1       김영사         1
2       민음사         3
3       마더텅         3
4  까치(까치글방)         1
5       한길사         1
6    저녁달고양이         1

- book1의 publisher 중 행의 수가 1개를 초과한 publisher를 가져옵니다.

In [97]:
%%SQL
SELECT publisher, count(*) cnt
FROM book1
WHERE count(*) > 1
GROUP BY publisher;

(cx_Oracle.DatabaseError) ORA-00934: group function is not allowed here
[SQL: SELECT publisher, count(*) cnt
FROM book1
WHERE count(*) > 1
GROUP BY publisher]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [98]:
%%SQL

SELECT publisher
FROM book1
GROUP BY publisher
HAVING count(*) > 1;

  publisher
1       민음사
2       마더텅

In [99]:
%%SQL
SELECT publisher
FROM book1
WHERE book_categ_id < 1000
GROUP BY publisher
HAVING count(*) > 1;

  publisher
1       민음사

- GROUP BY 표현식을 HAVING에서 사용할 수 있습니다.

In [100]:
%%SQL

SELECT publisher
FROM book1
GROUP BY publisher
HAVING publisher like '%사';

  publisher
1       김영사
2       민음사
3       한길사

- GROUP BY 표현식에 없거나, 출력행의 수가 다를 경우에는 쿼리가 성립하지 않습니다.

In [101]:
%%SQL

SELECT publisher
FROM book1
GROUP BY publisher
HAVING extract(YEAR from pub_date) >= 2000;

(cx_Oracle.DatabaseError) ORA-00979: not a GROUP BY expression
[SQL: SELECT publisher
FROM book1
GROUP BY publisher
HAVING extract(YEAR from pub_date) >= 2000]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

- 하지만 GROUPBY 보다 연산 순위가 앞선 WHERE에서는 GROUPBY와 행의 개수가 달라도 상관없습니다.

In [102]:
%%SQL

SELECT publisher
FROM book1
WHERE extract(YEAR from pub_date) >= 2000
GROUP BY publisher;

  publisher
1       김영사
2       민음사
3       마더텅
4  까치(까치글방)
5       한길사
6    저녁달고양이

## GROUP 함수

**GROUP BY 절에서 사용하는 함수**

|함수|기능|
|----|-----|
|ROLLUP|ROLLUP은 GROUP BY의 계층을 하나씩 높여 가면서 소계 연산을 수행|
|CUBE|GROUP BY 컬럼의 모든 조합에 대한 소계 연산을 수행|
|GROUPING SETS|GROUP BY 각 컬럼별 그룹핑 연산을 수행|

**[예제 25]** GROUP 함수를 사용하여 데이터 추출을 해봅니다.

In [103]:
%%SQL

SELECT count(*) FROM rating -- rating은 데이터의 수가 약 23000개 입니다.

   COUNT(*)
1     23104

In [104]:
%%SQL

SELECT * FROM rating -- rating으 내용을 봅니다.

       book_id          member_id  rating           rate_date
1           17  mvcxi5oa5spzr23ib       9 2022-02-09 09:31:07
2           17   n5d8tlcgk4udln6e      10 2022-01-25 16:54:04
3           17      ochprsofd798o      10 2022-12-18 16:47:55
4           17       peaap1snl98s       9 2022-08-03 11:30:48
5           17       psf9zn4cl64g       8 2023-05-28 09:12:41
...        ...                ...     ...                 ...
23100     3472          zgaq7op08       9 2023-08-18 15:51:37
23101     3472      zys13g57edy1e       9 2023-05-21 13:49:04
23102     3476     4d1ffxsvd57q27       9 2024-12-05 11:49:23
23103     3476      gcvi01ib0mp1x       9 2023-11-30 09:05:32
23104     3476      vc457dwkbw57y       6 2024-04-15 09:50:46

[23104 rows x 4 columns]

- GROUP 함수를 사용하지 않은 GROUP BY 구문입니다. rating의 rate_date에서 월과 요일을 추출하고, 이들을 그룹핑의 기준으로, rating의 합과, 행의 개수를 출력하는 SQL을 작성합니다.

In [105]:
%%SQL

SELECT extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY extract(MONTH from rate_date), to_char(rate_date, 'DY');

    EXTRACT(MONTHFROMRATE_DATE) TO_CHAR(RATE_DATE,'DY')  SUM(RATING)  COUNT(*)
1                             1                     TUE          388        42
2                             1                     SUN          481        54
3                             1                     THU          690        76
4                             2                     MON          372        42
5                             1                     WED          633        72
6                             2                     TUE          345        39
7                             2                     FRI          203        22
8                             1                     MON          462        54
9                             1                     SAT          471        55
10                            2                     WED          347        40
11                            2                     SAT          347        39
12                            1                     FRI          589        70
13                            2                     THU          407        47
14                            2                     SUN          244        28

- 위 구문에서 GROUP BY의 ROLLUP을 사용합니다.

In [106]:
%%SQL

SELECT extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY ROLLUP(extract(MONTH from rate_date), to_char(rate_date, 'DY'));

   EXTRACT(MONTHFROMRATE_DATE) TO_CHAR(RATE_DATE,'DY')  SUM(RATING)  COUNT(*)
1                          1.0                     TUE          388        42
2                          1.0                     SUN          481        54
3                          1.0                     THU          690        76
4                          2.0                     MON          372        42
5                          1.0                     WED          633        72
6                          2.0                     TUE          345        39
7                          2.0                     FRI          203        22
8                          1.0                     MON          462        54
9                          1.0                     SAT          471        55
10                         2.0                     WED          347        40
11                         2.0                     SAT          347        39
12                         1.0                     FRI          589        70
13                         2.0                     THU          407        47
14                         2.0                     SUN          244        28
15                         1.0                    NULL         3714       423
16                         2.0                    NULL         2265       257
17                        NULL                    NULL         5979       680

※ ROLLUP은 GROUP BY의 계층을 하나씩 높여 가면서 소계 작업까지를 수행합니다.

- 기본 GROUP BY SQL에 book_id 기준을 가장 앞에 추가하고 GROUP 함수 CUBE를 사용합니다.

In [107]:
%%SQL
SELECT book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY');

,book_id,EXTRACT(MONTHFROMRATE_DATE),"TO_CHAR(RATE_DATE,'DY')",SUM(RATING),COUNT(*)
1,24,2,TUE,10,1
2,24,2,FRI,8,1
3,24,1,MON,10,1
4,35,2,TUE,10,1
5,137,2,WED,8,1
...,...,...,...,...,...
635,3413,1,FRI,9,1
636,3360,1,FRI,8,1
637,3376,1,FRI,10,1
638,3382,2,SAT,9,1
639,3478,1,WED,9,1

In [108]:
%%SQL

SELECT book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY CUBE(book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'));

,book_id,EXTRACT(MONTHFROMRATE_DATE),"TO_CHAR(RATE_DATE,'DY')",SUM(RATING),COUNT(*)
1,NULL,NULL,NULL,5979,680
2,NULL,NULL,FRI,792,92
3,NULL,NULL,MON,834,96
4,NULL,NULL,SAT,818,94
5,NULL,NULL,SUN,725,82
...,...,...,...,...,...
2215,3481.0,1.0,FRI,17,2
2216,3484.0,NULL,NULL,10,1
2217,3484.0,NULL,THU,10,1
2218,3484.0,1.0,NULL,10,1
2219,3484.0,1.0,THU,10,1

※ CUBE는 GROUP BY의 뎁스별로 조합가능한 모든 그룹기준으로 소계 작업까지  수행합니다.

- 기본의 GROUP BY SQL에 book_id 기준을 가장 앞에 추가하고 GROUP 함수 GROUPING SET를 사용합니다.

In [109]:
%%SQL

SELECT book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY GROUPING SETS(book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'));

,book_id,EXTRACT(MONTHFROMRATE_DATE),"TO_CHAR(RATE_DATE,'DY')",SUM(RATING),COUNT(*)
1,NULL,NULL,FRI,792,92
2,NULL,NULL,WED,980,112
3,NULL,NULL,TUE,733,81
4,NULL,NULL,SUN,725,82
5,NULL,NULL,SAT,818,94
...,...,...,...,...,...
441,30.0,NULL,NULL,10,1
442,141.0,NULL,NULL,16,2
443,37.0,NULL,NULL,26,3
444,56.0,NULL,NULL,18,2
445,70.0,NULL,NULL,10,1

- GROUPING SETS는 항목별 GROUP BY를 하여 각각의 GROUP BY 결과를 결합하여 보여줍니다.

In [110]:
%%SQL

SELECT book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY GROUPING SETS(
    book_id, 
    (book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY')), 
    to_char(rate_date, 'DY'),
    (extract(MONTH from rate_date), to_char(rate_date, 'DY'))
);

,book_id,EXTRACT(MONTHFROMRATE_DATE),"TO_CHAR(RATE_DATE,'DY')",SUM(RATING),COUNT(*)
1,346.0,1.0,SUN,17,2
2,346.0,1.0,THU,27,3
3,156.0,2.0,WED,10,1
4,160.0,2.0,TUE,9,1
5,228.0,1.0,SAT,10,1
...,...,...,...,...,...
1092,20.0,NULL,NULL,9,1
1093,22.0,NULL,NULL,8,1
1094,53.0,NULL,NULL,65,7
1095,855.0,NULL,NULL,38,4
1096,1091.0,NULL,NULL,7,1

In [111]:
%%SQL

SELECT * FROM (
    SELECT book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'), 
        sum(rating), count(*)
    FROM rating
    WHERE extract(YEAR from rate_date) = 2025
    GROUP BY GROUPING SETS(book_id, extract(MONTH from rate_date), to_char(rate_date, 'DY'))
) WHERE book_id is NULL
;

,book_id,EXTRACT(MONTHFROMRATE_DATE),"TO_CHAR(RATE_DATE,'DY')",SUM(RATING),COUNT(*)
1,NULL,NULL,FRI,792,92
2,NULL,NULL,WED,980,112
3,NULL,NULL,TUE,733,81
4,NULL,NULL,SUN,725,82
5,NULL,NULL,SAT,818,94
6,NULL,NULL,THU,1097,123
7,NULL,NULL,MON,834,96
8,NULL,1.0,NULL,3714,423
9,NULL,2.0,NULL,2265,257

※ GROUPING SETES는 GROUP BY의 표현식 별로 소계은 하지 않고,  GROUP BY에서 다루지 않았던 것이 NULL로 들어갑니다.

### GROUPING 지원함수
    
|함수|기능|
|----|----|
|GROUPING|각 필드의 값이 소계 연산에 의한 것인지 파악<br/>CASE 구문과 조합하여 소계 연산에 대한 결과값을 지정<br/> **0**: 일반 groupby 연산, **1**: 소계 연산|

**[예제 26]** GROUPING 지원 함수를 활용해봅니다.

- GROUPING 연선 결과를 확인합니다.

In [112]:
%%SQL

SELECT extract(MONTH from rate_date), GROUPING(extract(MONTH from rate_date)), to_char(rate_date, 'DY'), GROUPING(to_char(rate_date, 'DY')),
    sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY GROUPING SETS(extract(MONTH from rate_date), to_char(rate_date, 'DY'));

,EXTRACT(MONTHFROMRATE_DATE),GROUPING(EXTRACT(MONTHFROMRATE_DATE)),"TO_CHAR(RATE_DATE,'DY')","GROUPING(TO_CHAR(RATE_DATE,'DY'))",SUM(RATING),COUNT(*)
1,NULL,1,WED,0,980,112
2,NULL,1,FRI,0,792,92
3,NULL,1,SUN,0,725,82
4,NULL,1,SAT,0,818,94
5,NULL,1,THU,0,1097,123
6,NULL,1,MON,0,834,96
7,NULL,1,TUE,0,733,81
8,1.0,0,NULL,1,3714,423
9,2.0,0,NULL,1,2265,257

- GROUPING을 이용하여 소계 연산 결과의 이름을 붙입니다.

In [113]:
%%SQL

SELECT CASE 
        WHEN GROUPING(extract(MONTH from rate_date)) = 0 THEN to_char(extract(MONTH from rate_date)) 
        ELSE '총합' 
    END as 월, 
    CASE 
        WHEN GROUPING(to_char(rate_date, 'DY')) = 0  THEN to_char(rate_date, 'DY')
        ELSE '소계'
    END as 요일, sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY ROLLUP(extract(MONTH from rate_date), to_char(rate_date, 'DY'));

     월   요일  SUM(RATING)  COUNT(*)
1    1  TUE          388        42
2    1  SUN          481        54
3    1  THU          690        76
4    2  MON          372        42
5    1  WED          633        72
6    2  TUE          345        39
7    2  FRI          203        22
8    1  MON          462        54
9    1  SAT          471        55
10   2  WED          347        40
11   2  SAT          347        39
12   1  FRI          589        70
13   2  THU          407        47
14   2  SUN          244        28
15   1   소계         3714       423
16   2   소계         2265       257
17  총합   소계         5979       680

# ORDER BY 절

```SQL
SELECT [DISTINCT] 표현식1 [as 명칭1], 표현식2 [as 명칭2], …
FROM 테이블명 [ALIAS]
[WHERE 조건식]
[GROUP BY 표현식1[, 표현식2, …]
[HAVING 그룹조건식]
[ORDER BY {컬럼 순서1|표현식1} [{ASC| DESC}][, {컬럼 순서2|표현식2}[{ASC|DESC}] …];
```

- ASC(Ascending): 오름차순, DESC(Descending): 내림차순
- 기본 정렬 순서는 ASC 오름차순입니다.
- 먼저 정의된 표현식의 출력값이 우선 기준이 됩니다.

**[예제 27]** ORDER BY를 통해 정렬 연산을 수행합니다.

- book1에서 첫 번째 기준으로 publisher는 오름차수, pub_date 내림 차순으로 정렬합니다.

In [114]:
%%SQL

SELECT * 
FROM book1 
ORDER BY publisher, pub_date DESC

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
3,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
4,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,1059,데미안,489,민음사,2000-12-01
7,1061,양철북 2,489,민음사,2000-03-01
8,1097,문학이란 무엇인가,509,민음사,1998-09-01
9,1092,동주와 빈센트,503,저녁달고양이,2019-09-01
10,1137,잃어버린 아이 이야기,534,한길사,2017-12-01

- ORDER BY 에서는 SELECT에서 선택하지 않은 컬럼도 사용 가능 합니다.

In [115]:
%%SQL

SELECT pub_date
FROM book1 
ORDER BY publisher, pub_date DESC

     pub_date
1  2015-11-01
2  2021-01-01
3  2019-12-01
4  2019-04-01
5  2018-03-01
6  2000-12-01
7  2000-03-01
8  1998-09-01
9  2019-09-01
10 2017-12-01

- GROUP BY가 사용될 경우 GROUP BY 집계 함수도 사용 가능

In [116]:
%%SQL

SELECT CASE 
        WHEN GROUPING(extract(MONTH from rate_date)) = 0 THEN to_char(extract(MONTH from rate_date)) 
        ELSE '총합' 
    END as 월, 
    CASE 
        WHEN GROUPING(to_char(rate_date, 'DY')) = 0  THEN to_char(rate_date, 'DY')
        ELSE DECODE(GROUPING(extract(MONTH from rate_date)), 0, '소계', '-')
    END as 요일, sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY ROLLUP(extract(MONTH from rate_date), to_char(rate_date, 'DY'));
ORDER BY 1, 2

     월   요일  SUM(RATING)  COUNT(*)
1    1  FRI          589        70
2    1  MON          462        54
3    1  SAT          471        55
4    1  SUN          481        54
5    1  THU          690        76
6    1  TUE          388        42
7    1  WED          633        72
8    1   소계         3714       423
9    2  FRI          203        22
10   2  MON          372        42
11   2  SAT          347        39
12   2  SUN          244        28
13   2  THU          407        47
14   2  TUE          345        39
15   2  WED          347        40
16   2   소계         2265       257
17  총합    -         5979       680

In [117]:
%%SQL

SELECT CASE 
        WHEN GROUPING(extract(MONTH from rate_date)) = 0 THEN to_char(extract(MONTH from rate_date)) 
        ELSE '총합' 
    END as 월, 
    CASE 
        WHEN GROUPING(to_char(rate_date, 'DY')) = 0  THEN to_char(rate_date, 'DY')
        ELSE DECODE(GROUPING(extract(MONTH from rate_date)), 0, '소계', '-')
    END as 요일, sum(rating), count(*)
FROM rating
WHERE extract(YEAR from rate_date) = 2025
GROUP BY ROLLUP(extract(MONTH from rate_date), to_char(rate_date, 'DY'));
ORDER BY 1, SUM(RATING)

     월   요일  SUM(RATING)  COUNT(*)
1    1  TUE          388        42
2    1  MON          462        54
3    1  SAT          471        55
4    1  SUN          481        54
5    1  FRI          589        70
6    1  WED          633        72
7    1  THU          690        76
8    1   소계         3714       423
9    2  FRI          203        22
10   2  SUN          244        28
11   2  TUE          345        39
12   2  WED          347        40
13   2  SAT          347        39
14   2  MON          372        42
15   2  THU          407        47
16   2   소계         2265       257
17  총합    -         5979       680

- Oracle에서는 NULL 값은 가장 큰 값으로 간주 / SQL Server는 NULL 값은 가장 작은 값으로 간주

In [118]:
%%SQL

SELECT * 
FROM rent1
ORDER BY rent_date

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
2,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
3,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
4,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
5,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
6,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
7,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
8,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL
9,3227,4,1gd09up7yy04g,1,NULL,NULL
10,156,1,j5ep1e6,1,NULL,NULL

# SELECT 문장의 실행 순서

**테이블 설정**

1. 대상 테이블 설정(FROM) \[→ 2. 대상 행 한정(WHERE)\] \[→ 3. 행 그룹핑(GROUP BY) \[4. 그룹핑한 행들의 집결 결과에서 한정(HAVING)\] \]

**컬럼 선택**

2. 설정된 테이블에서 조회할 컬럼을 선택(SELECT)

**행 정렬**

3. 선택된 컬럼을 기준으로 (ORDER BY)



```SQL
5. SELECT [DISTINCT] 표현식1 [as 명칭1], 표현식2 [as 명칭2], …
1. FROM 테이블명 [ALIAS]
2. [WHERE 조건식]
3. [GROUP BY 표현식1[, 표현식2, …]
4. [HAVING 그룹조건식]
6. [ORDER BY {컬럼 순서1|표현식1} [{ASC| DESC}][, {컬럼 순서2|표현식2}[{ASC|DESC}, …];
```

**[예제 28]** 예제 SQL을 통해 SELECT 문장의 실행 순서를 살펴 봅니다.

In [119]:
%%SQL

SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자, 
        avg(rating) as 평균평점, count(rating) as 평점수    -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                 -- 1. FROM을 통해 대상 테이블 지장
WHERE extract(YEAR from rate_date) in (2023, 2024)          -- 2. 테이블에서 행 한정
GROUP BY to_char(rate_date, 'yyyy-mm-dd')                   -- 3. 한정된 행에서 그룹핑
HAVING count(RATING) >= 5                                   -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 2                                                  -- 6. 조회한 데이터에서 정렬 (SELECT의 출력 순서를 숫자로 지정)

             일자                                      평균평점  평점수
1    2023-05-04  6.33333333333333333333333333333333333333    6
2    2023-05-05  6.57142857142857142857142857142857142857    7
3    2023-05-30  6.76923076923076923076923076923076923077   13
4    2023-05-17  7.11111111111111111111111111111111111111    9
5    2024-08-14                                     7.375    8
..          ...                                       ...  ...
712  2023-02-15                                       9.5   10
713  2024-12-11  9.53846153846153846153846153846153846154   13
714  2024-06-02                                       9.6   10
715  2024-05-20  9.71428571428571428571428571428571428571    7
716  2024-08-16  9.83333333333333333333333333333333333333    6

[716 rows x 3 columns]

In [120]:
%%SQL

SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자, 
        avg(rating) as 평균평점, count(rating) as 평점수    -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                 -- 1. FROM을 통해 대상 테이블 지장
WHERE 일자 in (2023, 2024)                                  -- 2. 테이블에서 행 한정 (나중에 수행되는 SELECT의 내용은 WHERE에서 참조하지 못합니다.)
GROUP BY to_char(rate_date, 'yyyy-mm-dd')                   -- 3. 한정된 행에서 그룹핑
HAVING count(RATING) >= 5                                   -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 2                                                  -- 6. 조회한 데이터에서 정렬

(cx_Oracle.DatabaseError) ORA-00904: "일자": invalid identifier
[SQL: SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자,
        avg(rating) as 평균평점, count(rating) as 평점수    -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                 -- 1. FROM을 통해 대상 테이블 지장
WHERE 일자 in (2023, 2024)                                  -- 2. 테이블에서 행 한정 (나중에 수행되는 SELECT의 내용은 WHERE에서 참조하지 못합니다.)
GROUP BY to_char(rate_date, 'yyyy-mm-dd')                   -- 3. 한정된 행에서 그룹핑
HAVING count(RATING) >= 5                                   -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 2                                                  -- 6. 조회한 데이터에서 정렬]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [121]:
%%SQL

SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자, 
        avg(rating) as 평균평점, count(rating) as 평점수    -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                 -- 1. FROM을 통해 대상 테이블 지장
WHERE extract(YEAR from rate_date) in (2023, 2024)          -- 2. 테이블에서 행 한정
GROUP BY to_char(rate_date, 'yyyy-mm-dd')                   -- 3. 한정된 행에서 그룹핑
HAVING count(RATING) >= 5                                   -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 평점수 DESC                                        -- 6. 조회한 데이터에서 정렬 (ORDER BY에서는 SELECT 구문보다 이후에 수행되므로 참조가 가능하죠)

             일자                                      평균평점  평점수
1    2023-05-20  8.78260869565217391304347826086956521739   23
2    2024-11-28  9.13043478260869565217391304347826086957   23
3    2024-03-27  8.38095238095238095238095238095238095238   21
4    2024-12-25  8.23809523809523809523809523809523809524   21
5    2023-02-14  8.19047619047619047619047619047619047619   21
..          ...                                       ...  ...
712  2023-05-11                                       9.2    5
713  2023-03-13                                       8.6    5
714  2024-02-18                                       8.4    5
715  2023-08-28                                         9    5
716  2023-09-04                                         9    5

[716 rows x 3 columns]

In [122]:
%%SQL

SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자, 
        avg(rating) as 평균평점, count(rating) as 평점수   -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                -- 1. FROM을 통해 대상 테이블 지장
WHERE extract(YEAR from rate_date) in (2023, 2024)         -- 2. 테이블에서 행 한정
GROUP BY 일자                                              -- 3. 에러: 순서항 SELECT 보다 앞서므로, SELECT에서 지정된 '일자' 컬럼을 사용할 수 없습니다. 
HAVING count(RATING) >= 5                                  -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 평점수 DESC                                       -- 6. 조회한 데이터에서 정렬

(cx_Oracle.DatabaseError) ORA-00904: "일자": invalid identifier
[SQL: SELECT to_char(rate_date, 'yyyy-mm-dd') as 일자,
        avg(rating) as 평균평점, count(rating) as 평점수   -- 5. FROM ~ HAVING 까지 설정된 테이블에서 컬럼 선택
FROM rating                                                -- 1. FROM을 통해 대상 테이블 지장
WHERE extract(YEAR from rate_date) in (2023, 2024)         -- 2. 테이블에서 행 한정
GROUP BY 일자                                              -- 3. 에러: 순서항 SELECT 보다 앞서므로, SELECT에서 지정된 '일자' 컬럼을 사용할 수 없습니다.
HAVING count(RATING) >= 5                                  -- 4. 그룹핑한 행들의 집계 결과에서 한정
ORDER BY 평점수 DESC                                       -- 6. 조회한 데이터에서 정렬]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

# JOIN

|조인|설명|
|------|-----|
|테이블1 INNER JOIN 테이블2 ON|ON 에서 결합 조건에 해당하는 행들만을 출력|
|테이블1 NATUAL JOIN 테이블2  [USING]| 두 테이블의 모든 동일한 컬럼명의 값이 같을 경우만 출력<br/>USING은 동일한 컬럼명중 비교에 대상을 한정할 경우 사용|
|테이블1 LEFT OUTER JOIN 테이블2 ON|테이블1의 행들은 모두 포함하고 ON을 만족하는 테이블2의 행들을 결합. 테이블2에서의 결합 데이터가 없을 경우 NULL값|
|테이블1 RIGHT OUTER JOIN 테이블2 ON|테이블2의 행들은 모두 포함하고 ON을 만족하는 테이블2의 행들을 결합. 테이블1에서의 결합 데이터가 없을 경우 NULL값|
|테이블1 FULL OUTER JOIN 테이블2 ON|테이블1, 테이블2에서 ON 기준으로 합집합에 해당하는 행들을 포함시켜 결합. 결합 데이터가 없을 경우 NULL값|
|테이블1 CROSS JOIN 테이블2|CATESIAN PRODUCT, 두 개의 테이블을 카테시안 곱을 통해 생성된 행들을 출력|

**[예제 29]** JOIN의 여러 연산을 확인합니다.

In [123]:
%%SQL

SELECT * FROM member1 -- member1의 내용을 봅니다.

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

In [124]:
%%SQL

SELECT * FROM rent WHERE extract(YEAR from rent_date) >= 2023 -- rent 중에서 2023년도 이후의 내역을 가져 옵니다.

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,3313,1,mnwnk3i07skx5ym,1,2023-06-02 13:43:43,2023-06-12 14:20:51
2,836,3,nuam2h9aiqh0,1,2023-06-02 11:52:17,2023-06-08 10:10:21
3,3287,1,1imlo4eb5mpgc80,1,2023-06-02 09:31:05,2023-06-05 09:51:17
4,3345,3,bwynf9xup,1,2023-06-02 11:19:49,2023-06-06 13:08:28
5,2480,1,c6ojslohir,1,2023-06-02 12:24:44,2023-06-10 16:00:15
...,...,...,...,...,...,...
36993,2462,3,nojamx67p5a7,1,2025-02-01 15:34:28,2025-02-07 16:47:10
36994,972,1,ql88j69qo2yrtjx2,1,2025-02-01 16:55:00,2025-02-10 11:06:31
36995,2199,1,odrq2tg3z0,1,2025-02-01 14:05:45,2025-02-06 15:48:50
36996,3227,1,y06p1o4azsy,1,2025-02-01 15:19:25,2025-02-07 11:20:15
36997,3458,2,23yjxjcccvti,1,2025-02-01 10:55:38,2025-02-08 12:36:08

- INNER JOIN을 이용하여 member1과 rent를 member_id를 기준으로 결합합니다.

In [125]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a INNER JOIN rent b ON a.member_id = b.member_id
WHERE extract(YEAR from rent_date) >= 2023
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3486,3,1,2023-12-30 11:22:53,2024-01-09 16:37:56
2,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3315,1,1,2024-12-24 14:41:13,2024-12-30 14:26:57
3,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,1058,1,1,2024-05-26 10:02:22,2024-05-30 11:31:30
4,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3450,2,1,2023-05-30 09:07:04,2023-06-07 13:22:49
5,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,1132,3,1,2023-09-01 11:26:24,2023-09-05 11:25:45
6,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,17,2,1,2024-08-25 13:55:17,2024-08-30 16:46:42
7,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,2219,4,1,2023-02-08 11:40:19,2023-02-16 13:51:08
8,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,2138,2,1,2024-01-07 13:09:57,2024-01-11 16:55:41
9,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,2189,1,1,2025-02-13 16:04:28,2025-02-21 16:44:55
10,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,150,3,1,2023-07-08 13:24:03,2023-07-14 15:35:01
11,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,13,2,1,2023-07-29 14:33:05,2023-08-06 13:50:57

- NATURAL JOIN을 이용하여 두 테이블의 동일한 컬럼명을 기준으로 결합합니다.

In [126]:
%%SQL

SELECT member_id, member_name, region, address1, address2, 
    book_id, stock_seq, rent_no, rent_date, return_date
FROM member1 NATURAL JOIN rent
WHERE extract(YEAR from rent_date) >= 2023
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3486,3,1,2023-12-30 11:22:53,2024-01-09 16:37:56
2,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3315,1,1,2024-12-24 14:41:13,2024-12-30 14:26:57
3,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,1058,1,1,2024-05-26 10:02:22,2024-05-30 11:31:30
4,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3450,2,1,2023-05-30 09:07:04,2023-06-07 13:22:49
5,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,1132,3,1,2023-09-01 11:26:24,2023-09-05 11:25:45
6,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,17,2,1,2024-08-25 13:55:17,2024-08-30 16:46:42
7,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,2219,4,1,2023-02-08 11:40:19,2023-02-16 13:51:08
8,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,2138,2,1,2024-01-07 13:09:57,2024-01-11 16:55:41
9,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,2189,1,1,2025-02-13 16:04:28,2025-02-21 16:44:55
10,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,150,3,1,2023-07-08 13:24:03,2023-07-14 15:35:01
11,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,13,2,1,2023-07-29 14:33:05,2023-08-06 13:50:57

In [127]:
%%SQL

SELECT * FROM rent1 -- rent1 테이블의 내용입니다.

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,3227,4,1gd09up7yy04g,1,NULL,NULL
2,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
3,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
4,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
5,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
6,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
7,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
8,156,1,j5ep1e6,1,NULL,NULL
9,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
10,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL

- LEFT OUTER JOIN을 이용하여 좌측의 테이블을 기준으로 우측의 테이블을 결합합니다. 우측 테이블에 내용일 없을 경우 NULL 값이 들어 갑니다.

In [128]:
%%SQL
SELECT * FROM member1

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

In [129]:
%%SQL
SELECT * FROM rent1

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,3227,4,1gd09up7yy04g,1,NULL,NULL
2,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50
3,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL
4,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57
5,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL
6,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10
7,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57
8,156,1,j5ep1e6,1,NULL,NULL
9,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43
10,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL

In [130]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a LEFT OUTER JOIN rent1 b ON a.member_id = b.member_id
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,NULL,NULL,NULL,NULL,NULL
2,3huv3i06r0kjq,장준,경기도,성남시 중원구,은행로 4번길,NULL,NULL,NULL,NULL,NULL
3,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,NULL,NULL,NULL,NULL,NULL
4,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,NULL,NULL,NULL,NULL,NULL
5,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,NULL,NULL,NULL,NULL,NULL
6,q056e4pksva2jxr4,박준우,인천광역시,남동구,선수촌로 1번길,NULL,NULL,NULL,NULL,NULL
7,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,NULL,NULL,NULL,NULL,NULL
8,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,NULL,NULL,NULL,NULL,NULL

- RIGHT OUTER JOIN을 이용하여 우측의 테이블을 기준으로 좌측의 테이블을 결합합니다. 좌측 테이블에 내용일 없을 경우 NULL 값이 들어 갑니다.

In [131]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a RIGHT OUTER JOIN rent1 b ON a.member_id = b.member_id
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,NULL,NULL,NULL,NULL,NULL,1471,1,1,2025-02-20 16:54:55,NULL
2,NULL,NULL,NULL,NULL,NULL,3239,3,1,2025-02-20 16:44:32,NULL
3,NULL,NULL,NULL,NULL,NULL,974,2,1,2025-02-20 16:40:54,NULL
4,NULL,NULL,NULL,NULL,NULL,1154,1,1,2025-02-20 16:26:49,2025-02-28 16:43:43
5,NULL,NULL,NULL,NULL,NULL,3227,4,1,NULL,NULL
6,NULL,NULL,NULL,NULL,NULL,1646,1,1,2025-02-20 16:08:11,2025-02-23 11:20:50
7,NULL,NULL,NULL,NULL,NULL,3118,1,1,2025-02-20 16:03:10,2025-02-25 12:24:10
8,NULL,NULL,NULL,NULL,NULL,1755,2,1,2025-02-20 15:56:00,2025-02-26 14:13:57
9,NULL,NULL,NULL,NULL,NULL,156,1,1,NULL,NULL
10,NULL,NULL,NULL,NULL,NULL,1320,2,1,2025-02-20 16:14:16,2025-02-25 10:47:57

- FULL OUTER JOIN을 이용하여 양측의 모두를 기준으로 member_id를 기준으로 합집합 연산을 하여 구성합니다.

In [132]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a FULL OUTER JOIN rent1 b ON a.member_id = b.member_id
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,NULL,NULL,NULL,NULL,NULL
2,3huv3i06r0kjq,장준,경기도,성남시 중원구,은행로 4번길,NULL,NULL,NULL,NULL,NULL
3,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,NULL,NULL,NULL,NULL,NULL
4,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,NULL,NULL,NULL,NULL,NULL
5,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,NULL,NULL,NULL,NULL,NULL
6,q056e4pksva2jxr4,박준우,인천광역시,남동구,선수촌로 1번길,NULL,NULL,NULL,NULL,NULL
7,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,NULL,NULL,NULL,NULL,NULL
8,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,NULL,NULL,NULL,NULL,NULL
9,NULL,NULL,NULL,NULL,NULL,3227.0,4.0,1.0,NULL,NULL
10,NULL,NULL,NULL,NULL,NULL,156.0,1.0,1.0,NULL,NULL
11,NULL,NULL,NULL,NULL,NULL,1755.0,2.0,1.0,2025-02-20 15:56:00,2025-02-26 14:13:57
12,NULL,NULL,NULL,NULL,NULL,3118.0,1.0,1.0,2025-02-20 16:03:10,2025-02-25 12:24:10
13,NULL,NULL,NULL,NULL,NULL,1646.0,1.0,1.0,2025-02-20 16:08:11,2025-02-23 11:20:50
14,NULL,NULL,NULL,NULL,NULL,1320.0,2.0,1.0,2025-02-20 16:14:16,2025-02-25 10:47:57
15,NULL,NULL,NULL,NULL,NULL,1154.0,1.0,1.0,2025-02-20 16:26:49,2025-02-28 16:43:43
16,NULL,NULL,NULL,NULL,NULL,974.0,2.0,1.0,2025-02-20 16:40:54,NULL
17,NULL,NULL,NULL,NULL,NULL,1471.0,1.0,1.0,2025-02-20 16:54:55,NULL
18,NULL,NULL,NULL,NULL,NULL,3239.0,3.0,1.0,2025-02-20 16:44:32,NULL

- 위의 예제에서는 교집합인 경우는 없었는데요, 교집합이 있는 경우의 출력을 확인합니다.

In [133]:
%%SQL
SELECT * FROM rent

,book_id,stock_seq,member_id,rent_no,rent_date,return_date
1,2175,2,2lf7ap4h5r49bcp,1,2019-10-05 12:34:07,2019-10-11 12:35:33
2,1127,1,rr4et1wd672tt,1,2019-10-05 14:49:50,2019-10-14 12:25:58
3,3290,1,n3uemivngv1e1,1,2019-10-05 14:44:52,2019-10-11 11:01:06
4,121,1,gwtclukwj2wdfhe3,1,2019-10-05 10:21:53,2019-10-09 12:03:12
5,2295,2,iwgi7jzaauy,1,2019-10-05 16:40:45,2019-10-12 09:56:11
...,...,...,...,...,...,...
91217,2462,3,nojamx67p5a7,1,2025-02-01 15:34:28,2025-02-07 16:47:10
91218,972,1,ql88j69qo2yrtjx2,1,2025-02-01 16:55:00,2025-02-10 11:06:31
91219,2199,1,odrq2tg3z0,1,2025-02-01 14:05:45,2025-02-06 15:48:50
91220,3227,1,y06p1o4azsy,1,2025-02-01 15:19:25,2025-02-07 11:20:15
91221,3458,2,23yjxjcccvti,1,2025-02-01 10:55:38,2025-02-08 12:36:08

In [134]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a LEFT OUTER JOIN rent b 
    ON a.member_id = b.member_id
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3486.0,3.0,1.0,2023-12-30 11:22:53,2024-01-09 16:37:56
2,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,1058.0,1.0,1.0,2024-05-26 10:02:22,2024-05-30 11:31:30
3,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3450.0,2.0,1.0,2023-05-30 09:07:04,2023-06-07 13:22:49
4,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3315.0,1.0,1.0,2024-12-24 14:41:13,2024-12-30 14:26:57
5,3huv3i06r0kjq,장준,경기도,성남시 중원구,은행로 4번길,NULL,NULL,NULL,NULL,NULL
6,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,1653.0,1.0,1.0,2022-06-20 16:32:34,2022-06-25 11:38:06
7,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,1059.0,3.0,1.0,2020-07-24 13:23:10,2020-08-03 12:32:56
8,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,1132.0,3.0,1.0,2023-09-01 11:26:24,2023-09-05 11:25:45
9,eqf2ulxx6fns6q,강예은,광주광역시,서구,풍암 8로,3270.0,3.0,1.0,2020-09-13 13:58:40,2020-09-17 16:09:28
10,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,17.0,2.0,1.0,2024-08-25 13:55:17,2024-08-30 16:46:42
11,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,2219.0,4.0,1.0,2023-02-08 11:40:19,2023-02-16 13:51:08
12,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,3224.0,3.0,1.0,2020-08-29 15:14:05,2020-09-06 15:00:02
13,fy32r7vjr0irp,박기현,경상남도,창원시 진해구,웅천북로 7번길,1063.0,3.0,1.0,2020-12-27 15:58:44,2021-01-01 14:27:56
14,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,476.0,2.0,1.0,2021-05-31 15:49:10,2021-06-09 13:03:23
15,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,308.0,4.0,1.0,2021-03-15 14:49:35,2021-03-24 14:32:29
16,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,850.0,3.0,1.0,2022-01-18 16:48:02,2022-01-26 13:14:23
17,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,2084.0,2.0,1.0,2020-05-02 11:56:05,2020-05-10 14:03:18
18,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,1724.0,1.0,1.0,2020-05-10 15:43:26,2020-05-14 13:33:49
19,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,585.0,1.0,1.0,2019-10-12 09:25:57,2019-10-19 13:40:40
20,pqdjzohyv0zx2u4,김가현,광주광역시,북구,효열로 9번길,1127.0,1.0,1.0,2021-07-05 12:01:39,2021-07-11 16:14:46
21,q056e4pksva2jxr4,박준우,인천광역시,남동구,선수촌로 1번길,NULL,NULL,NULL,NULL,NULL
22,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,1925.0,2.0,1.0,2019-12-06 11:54:29,2019-12-11 11:13:40
23,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,2949.0,1.0,1.0,2020-07-25 10:18:11,2020-07-28 15:44:57
24,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,1770.0,1.0,1.0,2021-03-23 12:16:31,2021-04-03 15:37:32
25,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,2138.0,2.0,1.0,2024-01-07 13:09:57,2024-01-11 16:55:41
26,tm965wcz7f4ob,이지후,충청북도,음성군,장성 3길,3410.0,1.0,1.0,2019-12-16 10:34:05,2019-12-23 12:44:08
27,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,2189.0,1.0,1.0,2025-02-13 16:04:28,2025-02-21 16:44:55
28,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,150.0,3.0,1.0,2023-07-08 13:24:03,2023-07-14 15:35:01
29,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,13.0,2.0,1.0,2023-07-29 14:33:05,2023-08-06 13:50:57

- CROSS JOIN으로 두 테이블에서 조합가능한 모든 경우를 출력합니다.

In [135]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a, rent1 b
WHERE a.member_id = b.member_id
ORDER BY 1

Empty DataFrame
Columns: [member_id, member_name, region, address1, address2, book_id, stock_seq, rent_no, rent_date, return_date]
Index: []

In [136]:
%%SQL

SELECT a.member_id, a.member_name, a.region, a.address1, a. address2, 
    b.book_id, b.stock_seq, b.rent_no, b.rent_date, b.return_date
FROM member1 a CROSS JOIN rent1 b
ORDER BY 1

,member_id,member_name,region,address1,address2,book_id,stock_seq,rent_no,rent_date,return_date
1,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,156,1,1,NULL,NULL
2,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,1755,2,1,2025-02-20 15:56:00,2025-02-26 14:13:57
3,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3118,1,1,2025-02-20 16:03:10,2025-02-25 12:24:10
4,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,1646,1,1,2025-02-20 16:08:11,2025-02-23 11:20:50
5,2457e3i56i37,정연서,충청남도,논산시,득안대로 2번길,3227,4,1,NULL,NULL
...,...,...,...,...,...,...,...,...,...,...
76,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,1154,1,1,2025-02-20 16:26:49,2025-02-28 16:43:43
77,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,974,2,1,2025-02-20 16:40:54,NULL
78,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,3239,3,1,2025-02-20 16:44:32,NULL
79,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,1471,1,1,2025-02-20 16:54:55,NULL
80,ze3herzyk1qt,황수호,경상북도,영주시,숫골길 2번길,1320,2,1,2025-02-20 16:14:16,2025-02-25 10:47:57

## Self-Join

1.
```SQL
SELECT ALIAS명1.컬럼명, ALIAS명2.컬럼명
FROM 테이블 ALIAS명1, 테이블 ALIAS명2
WHERE ALIAS명2.컬럼명 = ALIAS명1.컬럼명;
```
2.
```SQL
SELECT ALIAS명1.컬럼명, ALIAS명2.컬럼명
FROM 테이블 ALIAS명1 {INNER JOIN | {LEFT|RIGHT|FULL} OUTER JOIN} 테이블 ALIAS명2
ON ALIAS명2.컬럼명 = ALIAS명1.컬럼명;
```

**[예제 30]** Self Join을 가지고 계층적 구조를 지닌 테이블의 내용을 조회합니다.

In [137]:
%%SQL

SELECT * 
FROM BOOKCATEGORY -- 계층 구조를 지닌 테이블 입니다. parent_categ_id 는 레코드의 상위 카테고리의 id가 들어 있습니다.

,categ_id,categ_name,parent_categ_id,reg_date,use_yn,nav_seq
1,150,성공학/경력관리,149.0,2019-02-07 12:43:17,1,4
2,151,간부학/리더십,149.0,2019-02-04 13:01:15,1,1
3,152,기업/경영자스토리,149.0,2019-02-06 16:27:09,1,2
4,153,취업/유망직업,149.0,2019-02-07 11:21:22,1,3
5,154,화술/협상/회의진행,149.0,2019-02-08 16:01:28,1,5
...,...,...,...,...,...,...
1618,1302,고전/명작,1300.0,2023-11-14 16:56:17,1,2
1619,1303,역사/위인,1300.0,2023-11-15 13:38:31,1,3
1620,1304,자연/과학,1300.0,2023-11-17 10:56:37,1,5
1621,1305,국어/수학/영어,1300.0,2023-11-17 09:44:58,1,4
1622,1306,학습만화/애니메이션,1300.0,2023-11-21 10:36:19,1,8

- parent_categ_id가 NULL인 경우 즉 상위 카테고리가 없은 경우를 가져옵니다.

In [138]:
%%SQL

SELECT * FROM BOOKCATEGORY WHERE parent_categ_id is NULL

    categ_id categ_name parent_categ_id            reg_date  use_yn  nav_seq
1          1      가정 살림            NULL 2018-05-04 09:34:57       1        1
2         41      건강 취미            NULL 2018-05-10 09:32:47       1        4
3        116      경제 경영            NULL 2018-05-07 11:04:43       1        2
4        161  국어 외국어 사전            NULL 2018-05-08 15:20:48       1        3
5        237       대학교재            NULL 2018-05-11 16:20:33       1        5
6        351   만화/라이트노벨            NULL 2018-05-15 09:52:20       1        7
7        404      사회 정치            NULL 2018-05-15 15:45:17       1        8
8        479    소설/시/희곡            NULL 2018-05-15 09:14:43       1        6
9        537    수험서 자격증            NULL 2018-05-18 13:41:25       1        9
10       721        어린이            NULL 2018-05-18 16:30:51       1       10
11       828        에세이            NULL 2018-05-22 15:53:08       1       12
12       848         여행            NULL 2018-05-22 11:51:49       1       11
13       890         역사            NULL 2018-05-23 13:24:28       1       13
14       934         예술            NULL 2018-05-24 14:01:20       1       14
15       984         유아            NULL 2018-05-28 16:44:02       1       17
16      1059         인문            NULL 2018-05-28 13:54:01       1       16
17      1137         인물            NULL 2018-05-28 11:44:29       1       15
18      1153       자기계발            NULL 2018-05-31 10:44:18       1       18
19      1167       자연과학            NULL 2018-06-07 09:15:37       1       24
20      1230         잡지            NULL 2018-06-04 13:45:32       1       19
21      1271         전집            NULL 2018-06-05 10:09:57       1       20
22      1337         종교            NULL 2018-06-05 15:29:56       1       23
23      1381        청소년            NULL 2018-06-05 12:56:41       1       22
24      1394     IT 모바일            NULL 2018-06-05 10:51:51       1       21
25      1527      초등참고서            NULL 2018-06-08 09:27:18       1       25
26      1598     중고등참고서            NULL 2018-06-11 13:09:44       1       26

- INNER JOIN 좌, 우측 테이블 모두 BOOKCATEGORY를 사용하고 결합 기준을 categ_id와 parent_categ_id를 사용하여 레코드의 상위 카테고리를 가져 옵니다.

In [139]:
%%SQL

SELECT a.categ_name as 대분류, b.categ_name as 소분류
FROM BOOKCATEGORY a INNER JOIN BOOKCATEGORY b ON a.categ_id = b.parent_categ_id

            대분류         소분류
1     CEO/비즈니스맨    성공학/경력관리
2     CEO/비즈니스맨     간부학/리더십
3     CEO/비즈니스맨   기업/경영자스토리
4     CEO/비즈니스맨     취업/유망직업
5     CEO/비즈니스맨  화술/협상/회의진행
...         ...         ...
1592     초등 중학년       고전/명작
1593     초등 중학년       역사/위인
1594     초등 중학년       자연/과학
1595     초등 중학년    국어/수학/영어
1596     초등 중학년  학습만화/애니메이션

[1596 rows x 2 columns]

In [140]:
%%SQL
SELECT * FROM BOOKCATEGORY

,categ_id,categ_name,parent_categ_id,reg_date,use_yn,nav_seq
1,150,성공학/경력관리,149.0,2019-02-07 12:43:17,1,4
2,151,간부학/리더십,149.0,2019-02-04 13:01:15,1,1
3,152,기업/경영자스토리,149.0,2019-02-06 16:27:09,1,2
4,153,취업/유망직업,149.0,2019-02-07 11:21:22,1,3
5,154,화술/협상/회의진행,149.0,2019-02-08 16:01:28,1,5
...,...,...,...,...,...,...
1618,1302,고전/명작,1300.0,2023-11-14 16:56:17,1,2
1619,1303,역사/위인,1300.0,2023-11-15 13:38:31,1,3
1620,1304,자연/과학,1300.0,2023-11-17 10:56:37,1,5
1621,1305,국어/수학/영어,1300.0,2023-11-17 09:44:58,1,4
1622,1306,학습만화/애니메이션,1300.0,2023-11-21 10:36:19,1,8

In [141]:
%%SQL

SELECT a.categ_name as 대분류, b.categ_name as 소분류
FROM BOOKCATEGORY a LEFT OUTER JOIN BOOKCATEGORY b ON a.categ_id = b.parent_categ_id

            대분류         소분류
1     CEO/비즈니스맨    성공학/경력관리
2     CEO/비즈니스맨     간부학/리더십
3     CEO/비즈니스맨   기업/경영자스토리
4     CEO/비즈니스맨     취업/유망직업
5     CEO/비즈니스맨  화술/협상/회의진행
...         ...         ...
2981     퍼즐/스도쿠        NULL
2982        신화학        NULL
2983    중국어 입문서        NULL
2984   5-6학년 놀이        NULL
2985    디지털 카메라        NULL

[2985 rows x 2 columns]

## 계층형 질의 - Oracle DBMS

```SQL
SELECT …
FROM 테이블
[WHERE 조건문]
START WITH 조건문
CONNECT BY [NO CYCLE]  PRIOR 조건문
[ORDER SIBLINGS BY 컬럼1 또는 순서, … ]
```

**[예제 31]** 계층적 질의를 활용하여 재귀적으로 계측 구조를 가져오는 기능을 활용합니다.

- START WITH 에서는 첫번째 뎁스의 내용을 정의합니다: parent_categ_id 이 NULL인 것이니 상위 카테고리가 없는 것입니다. 즉 최상위 구조입니다.
- CONNECT BY 에서는 START WITH에서 추출한 내용 다음에 가져올 조건을 정의합니다. PRIOR 키워드가 있는 쪽이 상위구조의 컬럼입니다.

  여기서는 parent_categ_id가 상위 구조의 categ_id와 같으면 다음 단계 출력을로 가져오는데요. CONNECT BY에 해당하는 행이 없을 때까지 가져옵니다.
- ORDER SIBLING BY 에서는 이후에 가져오는 행들의 정렬의 기준입니다.

In [142]:
%%SQL

SELECT categ_id as 카테고리ID, categ_name as 카테고리명, nvl(parent_categ_id, 0) as 상위카테고리ID, nav_seq, LEVEL
FROM BOOKCATEGORY
START WITH parent_categ_id is NULL
CONNECT BY PRIOR categ_id = parent_categ_id
ORDER SIBLINGS BY nav_seq

      카테고리ID     카테고리명  상위카테고리ID  nav_seq  LEVEL
1          1     가정 살림         0        1      1
2          2     임신/출산         1        1      2
3          3        임신         2        1      3
4          4        태교         2        2      3
5          5        육아         1        2      2
...      ...       ...       ...      ...    ...
1618    1610     특목고대비      1599       11      3
1619    1619    EBS 교재      1598        3      2
1620    1620  EBS 고등학교      1619        1      3
1621    1621   EBS 중학교      1619        2      3
1622    1622   수시·논술대비      1598        4      2

[1622 rows x 5 columns]

In [143]:
%%SQL

SELECT categ_id as 카테고리ID, categ_name as 카테고리명, nvl(parent_categ_id, 0) as 상위카테고리ID, nav_seq
FROM BOOKCATEGORY
START WITH parent_categ_id is NULL-- AND categ_id = 1
CONNECT BY parent_categ_id = PRIOR categ_id
ORDER SIBLINGS BY nav_seq

      카테고리ID     카테고리명  상위카테고리ID  nav_seq
1          1     가정 살림         0        1
2          2     임신/출산         1        1
3          3        임신         2        1
4          4        태교         2        2
5          5        육아         1        2
...      ...       ...       ...      ...
1618    1610     특목고대비      1599       11
1619    1619    EBS 교재      1598        3
1620    1620  EBS 고등학교      1619        1
1621    1621   EBS 중학교      1619        2
1622    1622   수시·논술대비      1598        4

[1622 rows x 4 columns]

- SYS_CONNECT_BY_PATH를 사용하면 지금까지 자신을 포함한 탐색과정에 있던 CATEG_NAME을 가져옵니다.

In [144]:
%%SQL

SELECT categ_id as 카테고리ID, categ_name as 카테고리명, nvl(parent_categ_id, 0) as 상위카테고리ID, LEVEL, SYS_CONNECT_BY_PATH(categ_name, '|')
FROM BOOKCATEGORY
START WITH parent_categ_id is NULL AND categ_id = 1
CONNECT BY parent_categ_id = PRIOR categ_id
ORDER SIBLINGS BY nav_seq

    카테고리ID      카테고리명  상위카테고리ID  LEVEL SYS_CONNECT_BY_PATH(CATEG_NAME,'|')
1        1      가정 살림         0      1                              |가정 살림
2        2      임신/출산         1      2                        |가정 살림|임신/출산
3        3         임신         2      3                     |가정 살림|임신/출산|임신
4        4         태교         2      3                     |가정 살림|임신/출산|태교
5        5         육아         1      2                           |가정 살림|육아
6        6       성장발달         5      3                      |가정 살림|육아|성장발달
7        7   건강하게 키우기         5      3                  |가정 살림|육아|건강하게 키우기
8        8    바르게 키우기         5      3                   |가정 살림|육아|바르게 키우기
9        9    놀이로 키우기         5      3                   |가정 살림|육아|놀이로 키우기
10      10   육아법/육아일기         5      3                  |가정 살림|육아|육아법/육아일기
11      21         요리         1      2                           |가정 살림|요리
12      22       요리일반        21      3                      |가정 살림|요리|요리일반
13      23      생활요리         21      3                     |가정 살림|요리|생활요리
14      25      상황별요리        21      3                     |가정 살림|요리|상황별요리
15      24      개인요리책        21      3                     |가정 살림|요리|개인요리책
16      27  홈베이킹/베이커리        21      3                 |가정 살림|요리|홈베이킹/베이커리
17      26  메뉴별/나라별요리        21      3                 |가정 살림|요리|메뉴별/나라별요리
18      28     한국전통요리        21      3                    |가정 살림|요리|한국전통요리
19      29     차/술/음료        21      3                    |가정 살림|요리|차/술/음료
20      30       집/살림         1      2                         |가정 살림|집/살림
21      31       인테리어        30      3                    |가정 살림|집/살림|인테리어
22      33      살림의지혜        30      3                   |가정 살림|집/살림|살림의지혜
23      32      정리/수납        30      3                   |가정 살림|집/살림|정리/수납
24      34      정원가꾸기        30      3                   |가정 살림|집/살림|정원가꾸기
25      35       주거생활        30      3                    |가정 살림|집/살림|주거생활
26      11       자녀교육         1      2                         |가정 살림|자녀교육
27      12      학습법일반        11      3                   |가정 살림|자녀교육|학습법일반
28      13       놀이교육        11      3                    |가정 살림|자녀교육|놀이교육
29      16    감성/체험교육        11      3                 |가정 살림|자녀교육|감성/체험교육
30      15       영어교육        11      3                    |가정 살림|자녀교육|영어교육
31      14       독서교육        11      3                    |가정 살림|자녀교육|독서교육
32      18     초등생활지도        11      3                  |가정 살림|자녀교육|초등생활지도
33      17    영재/지능개발        11      3                 |가정 살림|자녀교육|영재/지능개발
34      19     좋은부모되기        11      3                  |가정 살림|자녀교육|좋은부모되기
35      20     자녀교육일반        11      3                  |가정 살림|자녀교육|자녀교육일반
36      36      결혼/가족         1      2                        |가정 살림|결혼/가족
37      38       부부관계        36      3                   |가정 살림|결혼/가족|부부관계
38      37         결혼        36      3                     |가정 살림|결혼/가족|결혼
39      39       가족관계        36      3                   |가정 살림|결혼/가족|가족관계
40      40        노부모        36      3                    |가정 살림|결혼/가족|노부모